ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l562xx.h
/*******************  Bit definition for EXTI_SWIER1 register  ***************/
#define EXTI_SWIER1_SWI0_Pos         (0U)
#define EXTI_SWIER1_SWI0_Msk         (0x1UL << EXTI_SWIER1_SWI0_Pos)           /*!< 0x00000001 */
#define EXTI_SWIER1_SWI0             EXTI_SWIER1_SWI0_Msk                      /*!< Software Interrupt on line 0 */
#define EXTI_SWIER1_SWI1_Pos         (1U)
#define EXTI_SWIER1_SWI1_Msk         (0x1UL << EXTI_SWIER1_SWI1_Pos)           /*!< 0x00000002 */
#define EXTI_SWIER1_SWI1             EXTI_SWIER1_SWI1_Msk                      /*!< Software Interrupt on line 1 */
#define EXTI_SWIER1_SWI2_Pos         (2U)
#define EXTI_SWIER1_SWI2_Msk         (0x1UL << EXTI_SWIER1_SWI2_Pos)           /*!< 0x00000004 */
#define EXTI_SWIER1_SWI2             EXTI_SWIER1_SWI2_Msk                      /*!< Software Interrupt on line 2 */
#define EXTI_SWIER1_SWI3_Pos         (3U)
#define EXTI_SWIER1_SWI3_Msk         (0x1UL << EXTI_SWIER1_SWI3_Pos)           /*!< 0x00000008 */
#define EXTI_SWIER1_SWI3             EXTI_SWIER1_SWI3_Msk                      /*!< Software Interrupt on line 3 */
#define EXTI_SWIER1_SWI4_Pos         (4U)
#define EXTI_SWIER1_SWI4_Msk         (0x1UL << EXTI_SWIER1_SWI4_Pos)           /*!< 0x00000010 */
#define EXTI_SWIER1_SWI4             EXTI_SWIER1_SWI4_Msk                      /*!< Software Interrupt on line 4 */
#define EXTI_SWIER1_SWI5_Pos         (5U)
#define EXTI_SWIER1_SWI5_Msk         (0x1UL << EXTI_SWIER1_SWI5_Pos)           /*!< 0x00000020 */
#define EXTI_SWIER1_SWI5             EXTI_SWIER1_SWI5_Msk                      /*!< Software Interrupt on line 5 */
#define EXTI_SWIER1_SWI6_Pos         (6U)
#define EXTI_SWIER1_SWI6_Msk         (0x1UL << EXTI_SWIER1_SWI6_Pos)           /*!< 0x00000040 */
#define EXTI_SWIER1_SWI6             EXTI_SWIER1_SWI6_Msk                      /*!< Software Interrupt on line 6 */
#define EXTI_SWIER1_SWI7_Pos         (7U)
#define EXTI_SWIER1_SWI7_Msk         (0x1UL << EXTI_SWIER1_SWI7_Pos)           /*!< 0x00000080 */
#define EXTI_SWIER1_SWI7             EXTI_SWIER1_SWI7_Msk                      /*!< Software Interrupt on line 7 */
#define EXTI_SWIER1_SWI8_Pos         (8U)
#define EXTI_SWIER1_SWI8_Msk         (0x1UL << EXTI_SWIER1_SWI8_Pos)           /*!< 0x00000100 */
#define EXTI_SWIER1_SWI8             EXTI_SWIER1_SWI8_Msk                      /*!< Software Interrupt on line 8 */
#define EXTI_SWIER1_SWI9_Pos         (9U)
#define EXTI_SWIER1_SWI9_Msk         (0x1UL << EXTI_SWIER1_SWI9_Pos)           /*!< 0x00000200 */
#define EXTI_SWIER1_SWI9             EXTI_SWIER1_SWI9_Msk                      /*!< Software Interrupt on line 9 */
#define EXTI_SWIER1_SWI10_Pos        (10U)
#define EXTI_SWIER1_SWI10_Msk        (0x1UL << EXTI_SWIER1_SWI10_Pos)          /*!< 0x00000400 */
#define EXTI_SWIER1_SWI10            EXTI_SWIER1_SWI10_Msk                     /*!< Software Interrupt on line 10 */
#define EXTI_SWIER1_SWI11_Pos        (11U)
#define EXTI_SWIER1_SWI11_Msk        (0x1UL << EXTI_SWIER1_SWI11_Pos)          /*!< 0x00000800 */
#define EXTI_SWIER1_SWI11            EXTI_SWIER1_SWI11_Msk                     /*!< Software Interrupt on line 11 */
#define EXTI_SWIER1_SWI12_Pos        (12U)
#define EXTI_SWIER1_SWI12_Msk        (0x1UL << EXTI_SWIER1_SWI12_Pos)          /*!< 0x00001000 */
#define EXTI_SWIER1_SWI12            EXTI_SWIER1_SWI12_Msk                     /*!< Software Interrupt on line 12 */
#define EXTI_SWIER1_SWI13_Pos        (13U)
#define EXTI_SWIER1_SWI13_Msk        (0x1UL << EXTI_SWIER1_SWI13_Pos)          /*!< 0x00002000 */
#define EXTI_SWIER1_SWI13            EXTI_SWIER1_SWI13_Msk                     /*!< Software Interrupt on line 13 */
#define EXTI_SWIER1_SWI14_Pos        (14U)
#define EXTI_SWIER1_SWI14_Msk        (0x1UL << EXTI_SWIER1_SWI14_Pos)          /*!< 0x00004000 */
#define EXTI_SWIER1_SWI14            EXTI_SWIER1_SWI14_Msk                     /*!< Software Interrupt on line 14 */
#define EXTI_SWIER1_SWI15_Pos        (15U)
#define EXTI_SWIER1_SWI15_Msk        (0x1UL << EXTI_SWIER1_SWI15_Pos)          /*!< 0x00008000 */
#define EXTI_SWIER1_SWI15            EXTI_SWIER1_SWI15_Msk                     /*!< Software Interrupt on line 15 */
#define EXTI_SWIER1_SWI16_Pos        (16U)
#define EXTI_SWIER1_SWI16_Msk        (0x1UL << EXTI_SWIER1_SWI16_Pos)          /*!< 0x00010000 */
#define EXTI_SWIER1_SWI16            EXTI_SWIER1_SWI16_Msk                     /*!< Software Interrupt on line 16 */
#define EXTI_SWIER1_SWI21_Pos        (21U)
#define EXTI_SWIER1_SWI21_Msk        (0x1UL << EXTI_SWIER1_SWI21_Pos)          /*!< 0x00200000 */
#define EXTI_SWIER1_SWI21            EXTI_SWIER1_SWI21_Msk                     /*!< Software Interrupt on line 21 */
#define EXTI_SWIER1_SWI22_Pos        (22U)
#define EXTI_SWIER1_SWI22_Msk        (0x1UL << EXTI_SWIER1_SWI22_Pos)          /*!< 0x00400000 */
#define EXTI_SWIER1_SWI22            EXTI_SWIER1_SWI22_Msk                     /*!< Software Interrupt on line 22 */
#define EXTI_SWIER1_SWI23_Pos        (23U)
#define EXTI_SWIER1_SWI23_Msk        (0x1UL << EXTI_SWIER1_SWI23_Pos)          /*!< 0x00800000 */
#define EXTI_SWIER1_SWI23            EXTI_SWIER1_SWI23_Msk                     /*!< Software Interrupt on line 23 */
#define EXTI_SWIER1_SWI24_Pos        (24U)
#define EXTI_SWIER1_SWI24_Msk        (0x1UL << EXTI_SWIER1_SWI24_Pos)          /*!< 0x01000000 */
#define EXTI_SWIER1_SWI24            EXTI_SWIER1_SWI24_Msk                     /*!< Software Interrupt on line 24 */
#define EXTI_SWIER1_SWI25_Pos        (25U)
#define EXTI_SWIER1_SWI25_Msk        (0x1UL << EXTI_SWIER1_SWI25_Pos)          /*!< 0x02000000 */
#define EXTI_SWIER1_SWI25            EXTI_SWIER1_SWI25_Msk                     /*!< Software Interrupt on line 25 */
#define EXTI_SWIER1_SWI26_Pos        (26U)
#define EXTI_SWIER1_SWI26_Msk        (0x1UL << EXTI_SWIER1_SWI26_Pos)          /*!< 0x04000000 */
#define EXTI_SWIER1_SWI26            EXTI_SWIER1_SWI26_Msk                     /*!< Software Interrupt on line 26 */
#define EXTI_SWIER1_SWI27_Pos        (27U)
#define EXTI_SWIER1_SWI27_Msk        (0x1UL << EXTI_SWIER1_SWI27_Pos)          /*!< 0x08000000 */
#define EXTI_SWIER1_SWI27            EXTI_SWIER1_SWI27_Msk                     /*!< Software Interrupt on line 27 */
#define EXTI_SWIER1_SWI28_Pos        (28U)
#define EXTI_SWIER1_SWI28_Msk        (0x1UL << EXTI_SWIER1_SWI28_Pos)          /*!< 0x10000000 */
#define EXTI_SWIER1_SWI28            EXTI_SWIER1_SWI28_Msk                     /*!< Software Interrupt on line 28 */
#define EXTI_SWIER1_SWI29_Pos        (29U)
#define EXTI_SWIER1_SWI29_Msk        (0x1UL << EXTI_SWIER1_SWI29_Pos)          /*!< 0x20000000 */
#define EXTI_SWIER1_SWI29            EXTI_SWIER1_SWI29_Msk                     /*!< Software Interrupt on line 29 */
#define EXTI_SWIER1_SWI30_Pos        (30U)
#define EXTI_SWIER1_SWI30_Msk        (0x1UL << EXTI_SWIER1_SWI30_Pos)          /*!< 0x40000000 */
#define EXTI_SWIER1_SWI30            EXTI_SWIER1_SWI30_Msk                     /*!< Software Interrupt on line 30 */
#define EXTI_SWIER1_SWI31_Pos        (31U)
#define EXTI_SWIER1_SWI31_Msk        (0x1UL << EXTI_SWIER1_SWI31_Pos)          /*!< 0x80000000 */
#define EXTI_SWIER1_SWI31            EXTI_SWIER1_SWI31_Msk                     /*!< Software Interrupt on line 31 */

/*******************  Bit definition for EXTI_SWIER2 register  ***************/
#define EXTI_SWIER2_SWI32_Pos        (0U)
#define EXTI_SWIER2_SWI32_Msk        (0x1UL << EXTI_SWIER2_SWI32_Pos)          /*!< 0x00000001 */
#define EXTI_SWIER2_SWI32            EXTI_SWIER2_SWI32_Msk                     /*!< Software Interrupt on line 32 */
#define EXTI_SWIER2_SWI33_Pos        (1U)
#define EXTI_SWIER2_SWI33_Msk        (0x1UL << EXTI_SWIER2_SWI33_Pos)          /*!< 0x00000002 */
#define EXTI_SWIER2_SWI33            EXTI_SWIER2_SWI33_Msk                     /*!< Software Interrupt on line 33 */
#define EXTI_SWIER2_SWI34_Pos        (2U)
#define EXTI_SWIER2_SWI34_Msk        (0x1UL << EXTI_SWIER2_SWI34_Pos)          /*!< 0x00000004 */
#define EXTI_SWIER2_SWI34            EXTI_SWIER2_SWI34_Msk                     /*!< Software Interrupt on line 34 */
#define EXTI_SWIER2_SWI35_Pos        (3U)
#define EXTI_SWIER2_SWI35_Msk        (0x1UL << EXTI_SWIER2_SWI35_Pos)          /*!< 0x00000008 */
#define EXTI_SWIER2_SWI35            EXTI_SWIER2_SWI35_Msk                     /*!< Software Interrupt on line 35 */
#define EXTI_SWIER2_SWI36_Pos        (4U)
#define EXTI_SWIER2_SWI36_Msk        (0x1UL << EXTI_SWIER2_SWI36_Pos)          /*!< 0x00000010 */
#define EXTI_SWIER2_SWI36            EXTI_SWIER2_SWI36_Msk                     /*!< Software Interrupt on line 36 */
#define EXTI_SWIER2_SWI37_Pos        (5U)
#define EXTI_SWIER2_SWI37_Msk        (0x1UL << EXTI_SWIER2_SWI37_Pos)          /*!< 0x00000020 */
#define EXTI_SWIER2_SWI37            EXTI_SWIER2_SWI37_Msk                     /*!< Software Interrupt on line 37 */
#define EXTI_SWIER2_SWI38_Pos        (6U)
#define EXTI_SWIER2_SWI38_Msk        (0x1UL << EXTI_SWIER2_SWI38_Pos)          /*!< 0x00000040 */
#define EXTI_SWIER2_SWI38            EXTI_SWIER2_SWI38_Msk                     /*!< Software Interrupt on line 38 */
#define EXTI_SWIER2_SWI39_Pos        (7U)
#define EXTI_SWIER2_SWI39_Msk        (0x1UL << EXTI_SWIER2_SWI39_Pos)          /*!< 0x00000080 */
#define EXTI_SWIER2_SWI39            EXTI_SWIER2_SWI39_Msk                     /*!< Software Interrupt on line 39 */
#define EXTI_SWIER2_SWI40_Pos        (8U)
#define EXTI_SWIER2_SWI40_Msk        (0x1UL << EXTI_SWIER2_SWI40_Pos)          /*!< 0x00000100 */
#define EXTI_SWIER2_SWI40            EXTI_SWIER2_SWI40_Msk                     /*!< Software Interrupt on line 40 */
#define EXTI_SWIER2_SWI41_Pos        (9U)
#define EXTI_SWIER2_SWI41_Msk        (0x1UL << EXTI_SWIER2_SWI41_Pos)          /*!< 0x00000200 */
#define EXTI_SWIER2_SWI41            EXTI_SWIER2_SWI41_Msk                     /*!< Software Interrupt on line 41 */
#define EXTI_SWIER2_SWI42_Pos        (10U)
#define EXTI_SWIER2_SWI42_Msk        (0x1UL << EXTI_SWIER2_SWI42_Pos)          /*!< 0x00000400 */
#define EXTI_SWIER2_SWI42            EXTI_SWIER2_SWI42_Msk                     /*!< Software Interrupt on line 42 */

/*******************  Bit definition for EXTI_RPR1 register  *****************/
#define EXTI_RPR1_RPIF0_Pos          (0U)
#define EXTI_RPR1_RPIF0_Msk          (0x1UL << EXTI_RPR1_RPIF0_Pos)            /*!< 0x00000001 */
#define EXTI_RPR1_RPIF0              EXTI_RPR1_RPIF0_Msk                       /*!< Rising Pending Interrupt Flag on line 0 */
#define EXTI_RPR1_RPIF1_Pos          (1U)
#define EXTI_RPR1_RPIF1_Msk          (0x1UL << EXTI_RPR1_RPIF1_Pos)            /*!< 0x00000002 */
#define EXTI_RPR1_RPIF1              EXTI_RPR1_RPIF1_Msk                       /*!< Rising Pending Interrupt Flag on line 1 */
#define EXTI_RPR1_RPIF2_Pos          (2U)
#define EXTI_RPR1_RPIF2_Msk          (0x1UL << EXTI_RPR1_RPIF2_Pos)            /*!< 0x00000004 */
#define EXTI_RPR1_RPIF2              EXTI_RPR1_RPIF2_Msk                       /*!< Rising Pending Interrupt Flag on line 2 */
#define EXTI_RPR1_RPIF3_Pos          (3U)
#define EXTI_RPR1_RPIF3_Msk          (0x1UL << EXTI_RPR1_RPIF3_Pos)            /*!< 0x00000008 */
#define EXTI_RPR1_RPIF3              EXTI_RPR1_RPIF3_Msk                       /*!< Rising Pending Interrupt Flag on line 3 */
#define EXTI_RPR1_RPIF4_Pos          (4U)
#define EXTI_RPR1_RPIF4_Msk          (0x1UL << EXTI_RPR1_RPIF4_Pos)            /*!< 0x00000010 */
#define EXTI_RPR1_RPIF4              EXTI_RPR1_RPIF4_Msk                       /*!< Rising Pending Interrupt Flag on line 4 */
#define EXTI_RPR1_RPIF5_Pos          (5U)
#define EXTI_RPR1_RPIF5_Msk          (0x1UL << EXTI_RPR1_RPIF5_Pos)            /*!< 0x00000020 */
#define EXTI_RPR1_RPIF5              EXTI_RPR1_RPIF5_Msk                       /*!< Rising Pending Interrupt Flag on line 5 */
#define EXTI_RPR1_RPIF6_Pos          (6U)
#define EXTI_RPR1_RPIF6_Msk          (0x1UL << EXTI_RPR1_RPIF6_Pos)            /*!< 0x00000040 */
#define EXTI_RPR1_RPIF6              EXTI_RPR1_RPIF6_Msk                       /*!< Rising Pending Interrupt Flag on line 6 */
#define EXTI_RPR1_RPIF7_Pos          (7U)
#define EXTI_RPR1_RPIF7_Msk          (0x1UL << EXTI_RPR1_RPIF7_Pos)            /*!< 0x00000080 */
#define EXTI_RPR1_RPIF7              EXTI_RPR1_RPIF7_Msk                       /*!< Rising Pending Interrupt Flag on line 7 */
#define EXTI_RPR1_RPIF8_Pos          (8U)
#define EXTI_RPR1_RPIF8_Msk          (0x1UL << EXTI_RPR1_RPIF8_Pos)            /*!< 0x00000100 */
#define EXTI_RPR1_RPIF8              EXTI_RPR1_RPIF8_Msk                       /*!< Rising Pending Interrupt Flag on line 8 */
#define EXTI_RPR1_RPIF9_Pos          (9U)
#define EXTI_RPR1_RPIF9_Msk          (0x1UL << EXTI_RPR1_RPIF9_Pos)            /*!< 0x00000200 */
#define EXTI_RPR1_RPIF9              EXTI_RPR1_RPIF9_Msk                       /*!< Rising Pending Interrupt Flag on line 9 */
#define EXTI_RPR1_RPIF10_Pos         (10U)
#define EXTI_RPR1_RPIF10_Msk         (0x1UL << EXTI_RPR1_RPIF10_Pos)           /*!< 0x00000400 */
#define EXTI_RPR1_RPIF10             EXTI_RPR1_RPIF10_Msk                      /*!< Rising Pending Interrupt Flag on line 10 */
#define EXTI_RPR1_RPIF11_Pos         (11U)
#define EXTI_RPR1_RPIF11_Msk         (0x1UL << EXTI_RPR1_RPIF11_Pos)           /*!< 0x00000800 */
#define EXTI_RPR1_RPIF11             EXTI_RPR1_RPIF11_Msk                      /*!< Rising Pending Interrupt Flag on line 11 */
#define EXTI_RPR1_RPIF12_Pos         (12U)
#define EXTI_RPR1_RPIF12_Msk         (0x1UL << EXTI_RPR1_RPIF12_Pos)           /*!< 0x00001000 */
#define EXTI_RPR1_RPIF12             EXTI_RPR1_RPIF12_Msk                      /*!< Rising Pending Interrupt Flag on line 12 */
#define EXTI_RPR1_RPIF13_Pos         (13U)
#define EXTI_RPR1_RPIF13_Msk         (0x1UL << EXTI_RPR1_RPIF13_Pos)           /*!< 0x00002000 */
#define EXTI_RPR1_RPIF13             EXTI_RPR1_RPIF13_Msk                      /*!< Rising Pending Interrupt Flag on line 13 */
#define EXTI_RPR1_RPIF14_Pos         (14U)
#define EXTI_RPR1_RPIF14_Msk         (0x1UL << EXTI_RPR1_RPIF14_Pos)           /*!< 0x00004000 */
#define EXTI_RPR1_RPIF14             EXTI_RPR1_RPIF14_Msk                      /*!< Rising Pending Interrupt Flag on line 14 */
#define EXTI_RPR1_RPIF15_Pos         (15U)
#define EXTI_RPR1_RPIF15_Msk         (0x1UL << EXTI_RPR1_RPIF15_Pos)           /*!< 0x00008000 */
#define EXTI_RPR1_RPIF15             EXTI_RPR1_RPIF15_Msk                      /*!< Rising Pending Interrupt Flag on line 15 */
#define EXTI_RPR1_RPIF16_Pos         (16U)
#define EXTI_RPR1_RPIF16_Msk         (0x1UL << EXTI_RPR1_RPIF16_Pos)           /*!< 0x00010000 */
#define EXTI_RPR1_RPIF16             EXTI_RPR1_RPIF16_Msk                      /*!< Rising Pending Interrupt Flag on line 16 */
#define EXTI_RPR1_RPIF21_Pos         (21U)
#define EXTI_RPR1_RPIF21_Msk         (0x1UL << EXTI_RPR1_RPIF21_Pos)           /*!< 0x00200000 */
#define EXTI_RPR1_RPIF21             EXTI_RPR1_RPIF21_Msk                      /*!< Rising Pending Interrupt Flag on line 21 */
#define EXTI_RPR1_RPIF22_Pos         (22U)
#define EXTI_RPR1_RPIF22_Msk         (0x1UL << EXTI_RPR1_RPIF22_Pos)           /*!< 0x00400000 */
#define EXTI_RPR1_RPIF22             EXTI_RPR1_RPIF22_Msk                      /*!< Rising Pending Interrupt Flag on line 22 */
#define EXTI_RPR1_RPIF23_Pos         (23U)
#define EXTI_RPR1_RPIF23_Msk         (0x1UL << EXTI_RPR1_RPIF23_Pos)           /*!< 0x00800000 */
#define EXTI_RPR1_RPIF23             EXTI_RPR1_RPIF23_Msk                      /*!< Rising Pending Interrupt Flag on line 23 */
#define EXTI_RPR1_RPIF24_Pos         (24U)
#define EXTI_RPR1_RPIF24_Msk         (0x1UL << EXTI_RPR1_RPIF24_Pos)           /*!< 0x01000000 */
#define EXTI_RPR1_RPIF24             EXTI_RPR1_RPIF24_Msk                      /*!< Rising Pending Interrupt Flag on line 24 */
#define EXTI_RPR1_RPIF25_Pos         (25U)
#define EXTI_RPR1_RPIF25_Msk         (0x1UL << EXTI_RPR1_RPIF25_Pos)           /*!< 0x02000000 */
#define EXTI_RPR1_RPIF25             EXTI_RPR1_RPIF25_Msk                      /*!< Rising Pending Interrupt Flag on line 25 */
#define EXTI_RPR1_RPIF26_Pos         (26U)
#define EXTI_RPR1_RPIF26_Msk         (0x1UL << EXTI_RPR1_RPIF26_Pos)           /*!< 0x04000000 */
#define EXTI_RPR1_RPIF26             EXTI_RPR1_RPIF26_Msk                      /*!< Rising Pending Interrupt Flag on line 26 */
#define EXTI_RPR1_RPIF27_Pos         (27U)
#define EXTI_RPR1_RPIF27_Msk         (0x1UL << EXTI_RPR1_RPIF27_Pos)           /*!< 0x08000000 */
#define EXTI_RPR1_RPIF27             EXTI_RPR1_RPIF27_Msk                      /*!< Rising Pending Interrupt Flag on line 27 */
#define EXTI_RPR1_RPIF28_Pos         (28U)
#define EXTI_RPR1_RPIF28_Msk         (0x1UL << EXTI_RPR1_RPIF28_Pos)           /*!< 0x10000000 */
#define EXTI_RPR1_RPIF28             EXTI_RPR1_RPIF28_Msk                      /*!< Rising Pending Interrupt Flag on line 28 */
#define EXTI_RPR1_RPIF29_Pos         (29U)
#define EXTI_RPR1_RPIF29_Msk         (0x1UL << EXTI_RPR1_RPIF29_Pos)           /*!< 0x20000000 */
#define EXTI_RPR1_RPIF29             EXTI_RPR1_RPIF29_Msk                      /*!< Rising Pending Interrupt Flag on line 29 */
#define EXTI_RPR1_RPIF30_Pos         (30U)
#define EXTI_RPR1_RPIF30_Msk         (0x1UL << EXTI_RPR1_RPIF30_Pos)           /*!< 0x40000000 */
#define EXTI_RPR1_RPIF30             EXTI_RPR1_RPIF30_Msk                      /*!< Rising Pending Interrupt Flag on line 30 */
#define EXTI_RPR1_RPIF31_Pos         (31U)
#define EXTI_RPR1_RPIF31_Msk         (0x1UL << EXTI_RPR1_RPIF31_Pos)           /*!< 0x80000000 */
#define EXTI_RPR1_RPIF31             EXTI_RPR1_RPIF31_Msk                      /*!< Rising Pending Interrupt Flag on line 31 */

/*******************  Bit definition for EXTI_RPR2 register  *****************/
#define EXTI_RPR2_RPIF32_Pos         (0U)
#define EXTI_RPR2_RPIF32_Msk         (0x1UL << EXTI_RPR2_RPIF32_Pos)           /*!< 0x00000001 */
#define EXTI_RPR2_RPIF32             EXTI_RPR2_RPIF32_Msk                      /*!< Rising Pending Interrupt Flag on line 32 */
#define EXTI_RPR2_RPIF33_Pos         (1U)
#define EXTI_RPR2_RPIF33_Msk         (0x1UL << EXTI_RPR2_RPIF33_Pos)           /*!< 0x00000002 */
#define EXTI_RPR2_RPIF33             EXTI_RPR2_RPIF33_Msk                      /*!< Rising Pending Interrupt Flag on line 33 */
#define EXTI_RPR2_RPIF34_Pos         (2U)
#define EXTI_RPR2_RPIF34_Msk         (0x1UL << EXTI_RPR2_RPIF34_Pos)           /*!< 0x00000004 */
#define EXTI_RPR2_RPIF34             EXTI_RPR2_RPIF34_Msk                      /*!< Rising Pending Interrupt Flag on line 34 */
#define EXTI_RPR2_RPIF35_Pos         (3U)
#define EXTI_RPR2_RPIF35_Msk         (0x1UL << EXTI_RPR2_RPIF35_Pos)           /*!< 0x00000008 */
#define EXTI_RPR2_RPIF35             EXTI_RPR2_RPIF35_Msk                      /*!< Rising Pending Interrupt Flag on line 35 */
#define EXTI_RPR2_RPIF36_Pos         (4U)
#define EXTI_RPR2_RPIF36_Msk         (0x1UL << EXTI_RPR2_RPIF36_Pos)           /*!< 0x00000010 */
#define EXTI_RPR2_RPIF36             EXTI_RPR2_RPIF36_Msk                      /*!< Rising Pending Interrupt Flag on line 36 */
#define EXTI_RPR2_RPIF37_Pos         (5U)
#define EXTI_RPR2_RPIF37_Msk         (0x1UL << EXTI_RPR2_RPIF37_Pos)           /*!< 0x00000020 */
#define EXTI_RPR2_RPIF37             EXTI_RPR2_RPIF37_Msk                      /*!< Rising Pending Interrupt Flag on line 37 */
#define EXTI_RPR2_RPIF38_Pos         (6U)
#define EXTI_RPR2_RPIF38_Msk         (0x1UL << EXTI_RPR2_RPIF38_Pos)           /*!< 0x00000040 */
#define EXTI_RPR2_RPIF38             EXTI_RPR2_RPIF38_Msk                      /*!< Rising Pending Interrupt Flag on line 38 */
#define EXTI_RPR2_RPIF39_Pos         (7U)
#define EXTI_RPR2_RPIF39_Msk         (0x1UL << EXTI_RPR2_RPIF39_Pos)           /*!< 0x00000080 */
#define EXTI_RPR2_RPIF39             EXTI_RPR2_RPIF39_Msk                      /*!< Rising Pending Interrupt Flag on line 39 */
#define EXTI_RPR2_RPIF40_Pos         (8U)
#define EXTI_RPR2_RPIF40_Msk         (0x1UL << EXTI_RPR2_RPIF40_Pos)           /*!< 0x00000100 */
#define EXTI_RPR2_RPIF40             EXTI_RPR2_RPIF40_Msk                      /*!< Rising Pending Interrupt Flag on line 40 */
#define EXTI_RPR2_RPIF41_Pos         (9U)
#define EXTI_RPR2_RPIF41_Msk         (0x1UL << EXTI_RPR2_RPIF41_Pos)           /*!< 0x00000200 */
#define EXTI_RPR2_RPIF41             EXTI_RPR2_RPIF41_Msk                      /*!< Rising Pending Interrupt Flag on line 41 */
#define EXTI_RPR2_RPIF42_Pos         (10U)
#define EXTI_RPR2_RPIF42_Msk         (0x1UL << EXTI_RPR2_RPIF42_Pos)           /*!< 0x00000400 */
#define EXTI_RPR2_RPIF42             EXTI_RPR2_RPIF42_Msk                      /*!< Rising Pending Interrupt Flag on line 42 */

