ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l562xx.h
/******************  Bits definition for FLASH_SECSR register  ****************/
#define FLASH_SECSR_SECEOP_Pos            (0U)
#define FLASH_SECSR_SECEOP_Msk            (0x1UL << FLASH_SECSR_SECEOP_Pos)    /*!< 0x00000001 */
#define FLASH_SECSR_SECEOP                FLASH_SECSR_SECEOP_Msk
#define FLASH_SECSR_SECOPERR_Pos          (1U)
#define FLASH_SECSR_SECOPERR_Msk          (0x1UL << FLASH_SECSR_SECOPERR_Pos)  /*!< 0x00000002 */
#define FLASH_SECSR_SECOPERR              FLASH_SECSR_SECOPERR_Msk
#define FLASH_SECSR_SECPROGERR_Pos        (3U)
#define FLASH_SECSR_SECPROGERR_Msk        (0x1UL << FLASH_SECSR_SECPROGERR_Pos)/*!< 0x00000008 */
#define FLASH_SECSR_SECPROGERR            FLASH_SECSR_SECPROGERR_Msk
#define FLASH_SECSR_SECWRPERR_Pos         (4U)
#define FLASH_SECSR_SECWRPERR_Msk         (0x1UL << FLASH_SECSR_SECWRPERR_Pos) /*!< 0x00000010 */
#define FLASH_SECSR_SECWRPERR             FLASH_SECSR_SECWRPERR_Msk
#define FLASH_SECSR_SECPGAERR_Pos         (5U)
#define FLASH_SECSR_SECPGAERR_Msk         (0x1UL << FLASH_SECSR_SECPGAERR_Pos) /*!< 0x00000020 */
#define FLASH_SECSR_SECPGAERR             FLASH_SECSR_SECPGAERR_Msk
#define FLASH_SECSR_SECSIZERR_Pos         (6U)
#define FLASH_SECSR_SECSIZERR_Msk         (0x1UL << FLASH_SECSR_SECSIZERR_Pos) /*!< 0x00000040 */
#define FLASH_SECSR_SECSIZERR             FLASH_SECSR_SECSIZERR_Msk
#define FLASH_SECSR_SECPGSERR_Pos         (7U)
#define FLASH_SECSR_SECPGSERR_Msk         (0x1UL << FLASH_SECSR_SECPGSERR_Pos) /*!< 0x00000080 */
#define FLASH_SECSR_SECPGSERR             FLASH_SECSR_SECPGSERR_Msk
#define FLASH_SECSR_SECBSY_Pos            (16U)
#define FLASH_SECSR_SECBSY_Msk            (0x1UL << FLASH_SECSR_SECBSY_Pos)    /*!< 0x00010000 */
#define FLASH_SECSR_SECBSY                FLASH_SECSR_SECBSY_Msk

/******************  Bits definition for FLASH_NSCR register  *****************/
#define FLASH_NSCR_NSPG_Pos               (0U)
#define FLASH_NSCR_NSPG_Msk               (0x1UL << FLASH_NSCR_NSPG_Pos)       /*!< 0x00000001 */
#define FLASH_NSCR_NSPG                   FLASH_NSCR_NSPG_Msk
#define FLASH_NSCR_NSPER_Pos              (1U)
#define FLASH_NSCR_NSPER_Msk              (0x1UL << FLASH_NSCR_NSPER_Pos)      /*!< 0x00000002 */
#define FLASH_NSCR_NSPER                  FLASH_NSCR_NSPER_Msk
#define FLASH_NSCR_NSMER1_Pos             (2U)
#define FLASH_NSCR_NSMER1_Msk             (0x1UL << FLASH_NSCR_NSMER1_Pos)     /*!< 0x00000004 */
#define FLASH_NSCR_NSMER1                 FLASH_NSCR_NSMER1_Msk
#define FLASH_NSCR_NSPNB_Pos              (3U)
#define FLASH_NSCR_NSPNB_Msk              (0x7FUL << FLASH_NSCR_NSPNB_Pos)     /*!< 0x000003F8 */
#define FLASH_NSCR_NSPNB                  FLASH_NSCR_NSPNB_Msk
#define FLASH_NSCR_NSBKER_Pos             (11U)
#define FLASH_NSCR_NSBKER_Msk             (0x1UL << FLASH_NSCR_NSBKER_Pos)     /*!< 0x00000800 */
#define FLASH_NSCR_NSBKER                 FLASH_NSCR_NSBKER_Msk
#define FLASH_NSCR_NSMER2_Pos             (15U)
#define FLASH_NSCR_NSMER2_Msk             (0x1UL << FLASH_NSCR_NSMER2_Pos)     /*!< 0x00008000 */
#define FLASH_NSCR_NSMER2                 FLASH_NSCR_NSMER2_Msk
#define FLASH_NSCR_NSSTRT_Pos             (16U)
#define FLASH_NSCR_NSSTRT_Msk             (0x1UL << FLASH_NSCR_NSSTRT_Pos)     /*!< 0x00010000 */
#define FLASH_NSCR_NSSTRT                 FLASH_NSCR_NSSTRT_Msk
#define FLASH_NSCR_OPTSTRT_Pos            (17U)
#define FLASH_NSCR_OPTSTRT_Msk            (0x1UL << FLASH_NSCR_OPTSTRT_Pos)    /*!< 0x00020000 */
#define FLASH_NSCR_OPTSTRT                FLASH_NSCR_OPTSTRT_Msk
#define FLASH_NSCR_NSEOPIE_Pos            (24U)
#define FLASH_NSCR_NSEOPIE_Msk            (0x1UL << FLASH_NSCR_NSEOPIE_Pos)    /*!< 0x01000000 */
#define FLASH_NSCR_NSEOPIE                FLASH_NSCR_NSEOPIE_Msk
#define FLASH_NSCR_NSERRIE_Pos            (25U)
#define FLASH_NSCR_NSERRIE_Msk            (0x1UL << FLASH_NSCR_NSERRIE_Pos)    /*!< 0x02000000 */
#define FLASH_NSCR_NSERRIE                FLASH_NSCR_NSERRIE_Msk
#define FLASH_NSCR_OBL_LAUNCH_Pos         (27U)
#define FLASH_NSCR_OBL_LAUNCH_Msk         (0x1UL << FLASH_NSCR_OBL_LAUNCH_Pos) /*!< 0x08000000 */
#define FLASH_NSCR_OBL_LAUNCH             FLASH_NSCR_OBL_LAUNCH_Msk
#define FLASH_NSCR_OPTLOCK_Pos            (30U)
#define FLASH_NSCR_OPTLOCK_Msk            (0x1UL << FLASH_NSCR_OPTLOCK_Pos)    /*!< 0x40000000 */
#define FLASH_NSCR_OPTLOCK                FLASH_NSCR_OPTLOCK_Msk
#define FLASH_NSCR_NSLOCK_Pos             (31U)
#define FLASH_NSCR_NSLOCK_Msk             (0x1UL << FLASH_NSCR_NSLOCK_Pos)     /*!< 0x80000000 */
#define FLASH_NSCR_NSLOCK                 FLASH_NSCR_NSLOCK_Msk

/******************  Bits definition for FLASH_SECCR register  ****************/
#define FLASH_SECCR_SECPG_Pos             (0U)
#define FLASH_SECCR_SECPG_Msk             (0x1UL << FLASH_SECCR_SECPG_Pos)     /*!< 0x00000001 */
#define FLASH_SECCR_SECPG                 FLASH_SECCR_SECPG_Msk
#define FLASH_SECCR_SECPER_Pos            (1U)
#define FLASH_SECCR_SECPER_Msk            (0x1UL << FLASH_SECCR_SECPER_Pos)    /*!< 0x00000002 */
#define FLASH_SECCR_SECPER                FLASH_SECCR_SECPER_Msk
#define FLASH_SECCR_SECMER1_Pos           (2U)
#define FLASH_SECCR_SECMER1_Msk           (0x1UL << FLASH_SECCR_SECMER1_Pos)   /*!< 0x00000004 */
#define FLASH_SECCR_SECMER1               FLASH_SECCR_SECMER1_Msk
#define FLASH_SECCR_SECPNB_Pos            (3U)
#define FLASH_SECCR_SECPNB_Msk            (0x7FUL << FLASH_SECCR_SECPNB_Pos)   /*!< 0x000003F8 */
#define FLASH_SECCR_SECPNB                FLASH_SECCR_SECPNB_Msk
#define FLASH_SECCR_SECBKER_Pos           (11U)
#define FLASH_SECCR_SECBKER_Msk           (0x1UL << FLASH_SECCR_SECBKER_Pos)   /*!< 0x00000800 */
#define FLASH_SECCR_SECBKER               FLASH_SECCR_SECBKER_Msk
#define FLASH_SECCR_SECMER2_Pos           (15U)
#define FLASH_SECCR_SECMER2_Msk           (0x1UL << FLASH_SECCR_SECMER2_Pos)   /*!< 0x00008000 */
#define FLASH_SECCR_SECMER2               FLASH_SECCR_SECMER2_Msk
#define FLASH_SECCR_SECSTRT_Pos           (16U)
#define FLASH_SECCR_SECSTRT_Msk           (0x1UL << FLASH_SECCR_SECSTRT_Pos)   /*!< 0x00010000 */
#define FLASH_SECCR_SECSTRT               FLASH_SECCR_SECSTRT_Msk
#define FLASH_SECCR_SECEOPIE_Pos          (24U)
#define FLASH_SECCR_SECEOPIE_Msk          (0x1UL << FLASH_SECCR_SECEOPIE_Pos)  /*!< 0x01000000 */
#define FLASH_SECCR_SECEOPIE              FLASH_SECCR_SECEOPIE_Msk
#define FLASH_SECCR_SECERRIE_Pos          (25U)
#define FLASH_SECCR_SECERRIE_Msk          (0x1UL << FLASH_SECCR_SECERRIE_Pos)  /*!< 0x02000000 */
#define FLASH_SECCR_SECERRIE              FLASH_SECCR_SECERRIE_Msk
#define FLASH_SECCR_SECINV_Pos            (29U)
#define FLASH_SECCR_SECINV_Msk            (0x1UL << FLASH_SECCR_SECINV_Pos)    /*!< 0x20000000 */
#define FLASH_SECCR_SECINV                FLASH_SECCR_SECINV_Msk
#define FLASH_SECCR_SECLOCK_Pos           (31U)
#define FLASH_SECCR_SECLOCK_Msk           (0x1UL << FLASH_SECCR_SECLOCK_Pos)   /*!< 0x80000000 */
#define FLASH_SECCR_SECLOCK               FLASH_SECCR_SECLOCK_Msk

/*******************  Bits definition for FLASH_ECCR register  ***************/
#define FLASH_ECCR_ADDR_ECC_Pos           (0U)
#define FLASH_ECCR_ADDR_ECC_Msk           (0x7FFFFUL << FLASH_ECCR_ADDR_ECC_Pos)/*!< 0x0007FFFF */
#define FLASH_ECCR_ADDR_ECC               FLASH_ECCR_ADDR_ECC_Msk
#define FLASH_ECCR_BK_ECC_Pos             (21U)
#define FLASH_ECCR_BK_ECC_Msk             (0x1UL << FLASH_ECCR_BK_ECC_Pos)      /*!< 0x00200000 */
#define FLASH_ECCR_BK_ECC                 FLASH_ECCR_BK_ECC_Msk
#define FLASH_ECCR_SYSF_ECC_Pos           (22U)
#define FLASH_ECCR_SYSF_ECC_Msk           (0x1UL << FLASH_ECCR_SYSF_ECC_Pos)    /*!< 0x00400000 */
#define FLASH_ECCR_SYSF_ECC               FLASH_ECCR_SYSF_ECC_Msk
#define FLASH_ECCR_ECCIE_Pos              (24U)
#define FLASH_ECCR_ECCIE_Msk              (0x1UL << FLASH_ECCR_ECCIE_Pos)       /*!< 0x01000000 */
#define FLASH_ECCR_ECCIE                  FLASH_ECCR_ECCIE_Msk
#define FLASH_ECCR_ECCC2_Pos              (28U)
#define FLASH_ECCR_ECCC2_Msk              (0x1UL << FLASH_ECCR_ECCC2_Pos)       /*!< 0x10000000 */
#define FLASH_ECCR_ECCC2                  FLASH_ECCR_ECCC2_Msk
#define FLASH_ECCR_ECCD2_Pos              (29U)
#define FLASH_ECCR_ECCD2_Msk              (0x1UL << FLASH_ECCR_ECCD2_Pos)       /*!< 0x20000000 */
#define FLASH_ECCR_ECCD2                  FLASH_ECCR_ECCD2_Msk
#define FLASH_ECCR_ECCC_Pos               (30U)
#define FLASH_ECCR_ECCC_Msk               (0x1UL << FLASH_ECCR_ECCC_Pos)        /*!< 0x40000000 */
#define FLASH_ECCR_ECCC                   FLASH_ECCR_ECCC_Msk
#define FLASH_ECCR_ECCD_Pos               (31U)
#define FLASH_ECCR_ECCD_Msk               (0x1UL << FLASH_ECCR_ECCD_Pos)        /*!< 0x80000000 */
#define FLASH_ECCR_ECCD                   FLASH_ECCR_ECCD_Msk

/*******************  Bits definition for FLASH_OPTR register  ***************/
#define FLASH_OPTR_RDP_Pos                (0U)
#define FLASH_OPTR_RDP_Msk                (0xFFUL << FLASH_OPTR_RDP_Pos)       /*!< 0x000000FF */
#define FLASH_OPTR_RDP                    FLASH_OPTR_RDP_Msk
#define FLASH_OPTR_BOR_LEV_Pos            (8U)
#define FLASH_OPTR_BOR_LEV_Msk            (0x7UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000700 */
#define FLASH_OPTR_BOR_LEV                FLASH_OPTR_BOR_LEV_Msk
#define FLASH_OPTR_BOR_LEV_0              (0x0UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000000 */
#define FLASH_OPTR_BOR_LEV_1              (0x1UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000100 */
#define FLASH_OPTR_BOR_LEV_2              (0x2UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000200 */
#define FLASH_OPTR_BOR_LEV_3              (0x3UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000300 */
#define FLASH_OPTR_BOR_LEV_4              (0x4UL << FLASH_OPTR_BOR_LEV_Pos)    /*!< 0x00000400 */
#define FLASH_OPTR_nRST_STOP_Pos          (12U)
#define FLASH_OPTR_nRST_STOP_Msk          (0x1UL << FLASH_OPTR_nRST_STOP_Pos)  /*!< 0x00001000 */
#define FLASH_OPTR_nRST_STOP              FLASH_OPTR_nRST_STOP_Msk
#define FLASH_OPTR_nRST_STDBY_Pos         (13U)
#define FLASH_OPTR_nRST_STDBY_Msk         (0x1UL << FLASH_OPTR_nRST_STDBY_Pos) /*!< 0x00002000 */
#define FLASH_OPTR_nRST_STDBY             FLASH_OPTR_nRST_STDBY_Msk
#define FLASH_OPTR_nRST_SHDW_Pos          (14U)
#define FLASH_OPTR_nRST_SHDW_Msk          (0x1UL << FLASH_OPTR_nRST_SHDW_Pos)  /*!< 0x00004000 */
#define FLASH_OPTR_nRST_SHDW              FLASH_OPTR_nRST_SHDW_Msk
#define FLASH_OPTR_IWDG_SW_Pos            (16U)
#define FLASH_OPTR_IWDG_SW_Msk            (0x1UL << FLASH_OPTR_IWDG_SW_Pos)    /*!< 0x00010000 */
#define FLASH_OPTR_IWDG_SW                FLASH_OPTR_IWDG_SW_Msk
#define FLASH_OPTR_IWDG_STOP_Pos          (17U)
#define FLASH_OPTR_IWDG_STOP_Msk          (0x1UL << FLASH_OPTR_IWDG_STOP_Pos)  /*!< 0x00020000 */
#define FLASH_OPTR_IWDG_STOP              FLASH_OPTR_IWDG_STOP_Msk
#define FLASH_OPTR_IWDG_STDBY_Pos         (18U)
#define FLASH_OPTR_IWDG_STDBY_Msk         (0x1UL << FLASH_OPTR_IWDG_STDBY_Pos) /*!< 0x00040000 */
#define FLASH_OPTR_IWDG_STDBY             FLASH_OPTR_IWDG_STDBY_Msk
#define FLASH_OPTR_WWDG_SW_Pos            (19U)
#define FLASH_OPTR_WWDG_SW_Msk            (0x1UL << FLASH_OPTR_WWDG_SW_Pos)    /*!< 0x00080000 */
#define FLASH_OPTR_WWDG_SW                FLASH_OPTR_WWDG_SW_Msk
#define FLASH_OPTR_SWAP_BANK_Pos          (20U)
#define FLASH_OPTR_SWAP_BANK_Msk          (0x1UL << FLASH_OPTR_SWAP_BANK_Pos)  /*!< 0x00100000 */
#define FLASH_OPTR_SWAP_BANK              FLASH_OPTR_SWAP_BANK_Msk
#define FLASH_OPTR_DB256K_Pos             (21U)
#define FLASH_OPTR_DB256K_Msk             (0x1UL << FLASH_OPTR_DB256K_Pos)     /*!< 0x00200000 */
#define FLASH_OPTR_DB256K                 FLASH_OPTR_DB256K_Msk
#define FLASH_OPTR_DBANK_Pos              (22U)
#define FLASH_OPTR_DBANK_Msk              (0x1UL << FLASH_OPTR_DBANK_Pos)      /*!< 0x00400000 */
#define FLASH_OPTR_DBANK                  FLASH_OPTR_DBANK_Msk
#define FLASH_OPTR_SRAM2_PE_Pos           (24U)
#define FLASH_OPTR_SRAM2_PE_Msk           (0x1UL << FLASH_OPTR_SRAM2_PE_Pos)   /*!< 0x01000000 */
#define FLASH_OPTR_SRAM2_PE               FLASH_OPTR_SRAM2_PE_Msk
#define FLASH_OPTR_SRAM2_RST_Pos          (25U)
#define FLASH_OPTR_SRAM2_RST_Msk          (0x1UL << FLASH_OPTR_SRAM2_RST_Pos)  /*!< 0x02000000 */
#define FLASH_OPTR_SRAM2_RST              FLASH_OPTR_SRAM2_RST_Msk
#define FLASH_OPTR_nSWBOOT0_Pos           (26U)
#define FLASH_OPTR_nSWBOOT0_Msk           (0x1UL << FLASH_OPTR_nSWBOOT0_Pos)   /*!< 0x04000000 */
#define FLASH_OPTR_nSWBOOT0               FLASH_OPTR_nSWBOOT0_Msk
#define FLASH_OPTR_nBOOT0_Pos             (27U)
#define FLASH_OPTR_nBOOT0_Msk             (0x1UL << FLASH_OPTR_nBOOT0_Pos)     /*!< 0x08000000 */
#define FLASH_OPTR_nBOOT0                 FLASH_OPTR_nBOOT0_Msk
#define FLASH_OPTR_PA15_PUPEN_Pos         (28U)
#define FLASH_OPTR_PA15_PUPEN_Msk         (0x1UL << FLASH_OPTR_PA15_PUPEN_Pos) /*!< 0x10000000 */
#define FLASH_OPTR_PA15_PUPEN             FLASH_OPTR_PA15_PUPEN_Msk
#define FLASH_OPTR_TZEN_Pos               (31U)
#define FLASH_OPTR_TZEN_Msk               (0x1UL << FLASH_OPTR_TZEN_Pos)       /*!< 0x80000000 */
#define FLASH_OPTR_TZEN                   FLASH_OPTR_TZEN_Msk

/****************  Bits definition for FLASH_NSBOOTADD0R register  ************/
#define FLASH_NSBOOTADD0R_NSBOOTADD0_Pos  (7U)
#define FLASH_NSBOOTADD0R_NSBOOTADD0_Msk  (0x1FFFFFFUL << FLASH_NSBOOTADD0R_NSBOOTADD0_Pos)/*!< 0xFFFFFF80 */
#define FLASH_NSBOOTADD0R_NSBOOTADD0      FLASH_NSBOOTADD0R_NSBOOTADD0_Msk

