ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l562xx.h
/********************  Bit definition for PWR_SR2 register  ********************/
#define PWR_SR2_REGLPS_Pos           (8U)
#define PWR_SR2_REGLPS_Msk           (0x1UL << PWR_SR2_REGLPS_Pos)             /*!< 0x00000100 */
#define PWR_SR2_REGLPS               PWR_SR2_REGLPS_Msk                        /*!< Low-power Regulator Started */
#define PWR_SR2_REGLPF_Pos           (9U)
#define PWR_SR2_REGLPF_Msk           (0x1UL << PWR_SR2_REGLPF_Pos)             /*!< 0x00000200 */
#define PWR_SR2_REGLPF               PWR_SR2_REGLPF_Msk                        /*!< Low-power Regulator Flag */
#define PWR_SR2_VOSF_Pos             (10U)
#define PWR_SR2_VOSF_Msk             (0x1UL << PWR_SR2_VOSF_Pos)               /*!< 0x00000400 */
#define PWR_SR2_VOSF                 PWR_SR2_VOSF_Msk                          /*!< Voltage Scaling Flag */
#define PWR_SR2_PVDO_Pos             (11U)
#define PWR_SR2_PVDO_Msk             (0x1UL << PWR_SR2_PVDO_Pos)               /*!< 0x00000800 */
#define PWR_SR2_PVDO                 PWR_SR2_PVDO_Msk                          /*!< Power Voltage Detector Output */
#define PWR_SR2_PVMO1_Pos            (12U)
#define PWR_SR2_PVMO1_Msk            (0x1UL << PWR_SR2_PVMO1_Pos)              /*!< 0x00001000 */
#define PWR_SR2_PVMO1                PWR_SR2_PVMO1_Msk                         /*!< Peripheral Voltage Monitoring Output 1 */
#define PWR_SR2_PVMO2_Pos            (13U)
#define PWR_SR2_PVMO2_Msk            (0x1UL << PWR_SR2_PVMO2_Pos)              /*!< 0x00002000 */
#define PWR_SR2_PVMO2                PWR_SR2_PVMO2_Msk                         /*!< Peripheral Voltage Monitoring Output 2 */
#define PWR_SR2_PVMO3_Pos            (14U)
#define PWR_SR2_PVMO3_Msk            (0x1UL << PWR_SR2_PVMO3_Pos)              /*!< 0x00004000 */
#define PWR_SR2_PVMO3                PWR_SR2_PVMO3_Msk                         /*!< Peripheral Voltage Monitoring Output 3 */
#define PWR_SR2_PVMO4_Pos            (15U)
#define PWR_SR2_PVMO4_Msk            (0x1UL << PWR_SR2_PVMO4_Pos)              /*!< 0x00008000 */
#define PWR_SR2_PVMO4                PWR_SR2_PVMO4_Msk                         /*!< Peripheral Voltage Monitoring Output 4 */

/********************  Bit definition for PWR_SCR register  ********************/
#define PWR_SCR_CWUF_Pos             (0U)
#define PWR_SCR_CWUF_Msk             (0x1FUL << PWR_SCR_CWUF_Pos)              /*!< 0x0000001F */
#define PWR_SCR_CWUF                 PWR_SCR_CWUF_Msk                          /*!< Clear Wake-up Flags  */
#define PWR_SCR_CWUF1_Pos            (0U)
#define PWR_SCR_CWUF1_Msk            (0x1UL << PWR_SCR_CWUF1_Pos)              /*!< 0x00000001 */
#define PWR_SCR_CWUF1                PWR_SCR_CWUF1_Msk                         /*!< Clear Wake-up Flag 1 */
#define PWR_SCR_CWUF2_Pos            (1U)
#define PWR_SCR_CWUF2_Msk            (0x1UL << PWR_SCR_CWUF2_Pos)              /*!< 0x00000002 */
#define PWR_SCR_CWUF2                PWR_SCR_CWUF2_Msk                         /*!< Clear Wake-up Flag 2 */
#define PWR_SCR_CWUF3_Pos            (2U)
#define PWR_SCR_CWUF3_Msk            (0x1UL << PWR_SCR_CWUF3_Pos)              /*!< 0x00000004 */
#define PWR_SCR_CWUF3                PWR_SCR_CWUF3_Msk                         /*!< Clear Wake-up Flag 3 */
#define PWR_SCR_CWUF4_Pos            (3U)
#define PWR_SCR_CWUF4_Msk            (0x1UL << PWR_SCR_CWUF4_Pos)              /*!< 0x00000008 */
#define PWR_SCR_CWUF4                PWR_SCR_CWUF4_Msk                         /*!< Clear Wake-up Flag 4 */
#define PWR_SCR_CWUF5_Pos            (4U)
#define PWR_SCR_CWUF5_Msk            (0x1UL << PWR_SCR_CWUF5_Pos)              /*!< 0x00000010 */
#define PWR_SCR_CWUF5                PWR_SCR_CWUF5_Msk                         /*!< Clear Wake-up Flag 5 */
#define PWR_SCR_CSBF_Pos             (8U)
#define PWR_SCR_CSBF_Msk             (0x1UL << PWR_SCR_CSBF_Pos)               /*!< 0x00000100 */
#define PWR_SCR_CSBF                 PWR_SCR_CSBF_Msk                          /*!< Clear Stand-By Flag */

/********************  Bit definition for PWR_PUCRA register  ********************/
#define PWR_PUCRA_PU0_Pos            (0U)
#define PWR_PUCRA_PU0_Msk            (0x1UL << PWR_PUCRA_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRA_PU0                PWR_PUCRA_PU0_Msk                         /*!< Port PA0 Pull-Up set  */
#define PWR_PUCRA_PU1_Pos            (1U)
#define PWR_PUCRA_PU1_Msk            (0x1UL << PWR_PUCRA_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRA_PU1                PWR_PUCRA_PU1_Msk                         /*!< Port PA1 Pull-Up set  */
#define PWR_PUCRA_PU2_Pos            (2U)
#define PWR_PUCRA_PU2_Msk            (0x1UL << PWR_PUCRA_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRA_PU2                PWR_PUCRA_PU2_Msk                         /*!< Port PA2 Pull-Up set  */
#define PWR_PUCRA_PU3_Pos            (3U)
#define PWR_PUCRA_PU3_Msk            (0x1UL << PWR_PUCRA_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRA_PU3                PWR_PUCRA_PU3_Msk                         /*!< Port PA3 Pull-Up set  */
#define PWR_PUCRA_PU4_Pos            (4U)
#define PWR_PUCRA_PU4_Msk            (0x1UL << PWR_PUCRA_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRA_PU4                PWR_PUCRA_PU4_Msk                         /*!< Port PA4 Pull-Up set  */
#define PWR_PUCRA_PU5_Pos            (5U)
#define PWR_PUCRA_PU5_Msk            (0x1UL << PWR_PUCRA_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRA_PU5                PWR_PUCRA_PU5_Msk                         /*!< Port PA5 Pull-Up set  */
#define PWR_PUCRA_PU6_Pos            (6U)
#define PWR_PUCRA_PU6_Msk            (0x1UL << PWR_PUCRA_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRA_PU6                PWR_PUCRA_PU6_Msk                         /*!< Port PA6 Pull-Up set  */
#define PWR_PUCRA_PU7_Pos            (7U)
#define PWR_PUCRA_PU7_Msk            (0x1UL << PWR_PUCRA_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRA_PU7                PWR_PUCRA_PU7_Msk                         /*!< Port PA7 Pull-Up set  */
#define PWR_PUCRA_PU8_Pos            (8U)
#define PWR_PUCRA_PU8_Msk            (0x1UL << PWR_PUCRA_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRA_PU8                PWR_PUCRA_PU8_Msk                         /*!< Port PA8 Pull-Up set  */
#define PWR_PUCRA_PU9_Pos            (9U)
#define PWR_PUCRA_PU9_Msk            (0x1UL << PWR_PUCRA_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRA_PU9                PWR_PUCRA_PU9_Msk                         /*!< Port PA9 Pull-Up set  */
#define PWR_PUCRA_PU10_Pos           (10U)
#define PWR_PUCRA_PU10_Msk           (0x1UL << PWR_PUCRA_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRA_PU10               PWR_PUCRA_PU10_Msk                        /*!< Port PA10 Pull-Up set */
#define PWR_PUCRA_PU11_Pos           (11U)
#define PWR_PUCRA_PU11_Msk           (0x1UL << PWR_PUCRA_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRA_PU11               PWR_PUCRA_PU11_Msk                        /*!< Port PA11 Pull-Up set */
#define PWR_PUCRA_PU12_Pos           (12U)
#define PWR_PUCRA_PU12_Msk           (0x1UL << PWR_PUCRA_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRA_PU12               PWR_PUCRA_PU12_Msk                        /*!< Port PA12 Pull-Up set */
#define PWR_PUCRA_PU13_Pos           (13U)
#define PWR_PUCRA_PU13_Msk           (0x1UL << PWR_PUCRA_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRA_PU13               PWR_PUCRA_PU13_Msk                        /*!< Port PA13 Pull-Up set */
#define PWR_PUCRA_PU14_Pos           (14U)
#define PWR_PUCRA_PU14_Msk           (0x1UL << PWR_PUCRA_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRA_PU14               PWR_PUCRA_PU14_Msk                        /*!< Port PA14 Pull-Up set */
#define PWR_PUCRA_PU15_Pos           (15U)
#define PWR_PUCRA_PU15_Msk           (0x1UL << PWR_PUCRA_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRA_PU15               PWR_PUCRA_PU15_Msk                        /*!< Port PA15 Pull-Up set */

/********************  Bit definition for PWR_PDCRA register  ********************/
#define PWR_PDCRA_PD0_Pos            (0U)
#define PWR_PDCRA_PD0_Msk            (0x1UL << PWR_PDCRA_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRA_PD0                PWR_PDCRA_PD0_Msk                         /*!< Port PA0 Pull-Down set  */
#define PWR_PDCRA_PD1_Pos            (1U)
#define PWR_PDCRA_PD1_Msk            (0x1UL << PWR_PDCRA_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRA_PD1                PWR_PDCRA_PD1_Msk                         /*!< Port PA1 Pull-Down set  */
#define PWR_PDCRA_PD2_Pos            (2U)
#define PWR_PDCRA_PD2_Msk            (0x1UL << PWR_PDCRA_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRA_PD2                PWR_PDCRA_PD2_Msk                         /*!< Port PA2 Pull-Down set  */
#define PWR_PDCRA_PD3_Pos            (3U)
#define PWR_PDCRA_PD3_Msk            (0x1UL << PWR_PDCRA_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRA_PD3                PWR_PDCRA_PD3_Msk                         /*!< Port PA3 Pull-Down set  */
#define PWR_PDCRA_PD4_Pos            (4U)
#define PWR_PDCRA_PD4_Msk            (0x1UL << PWR_PDCRA_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRA_PD4                PWR_PDCRA_PD4_Msk                         /*!< Port PA4 Pull-Down set  */
#define PWR_PDCRA_PD5_Pos            (5U)
#define PWR_PDCRA_PD5_Msk            (0x1UL << PWR_PDCRA_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRA_PD5                PWR_PDCRA_PD5_Msk                         /*!< Port PA5 Pull-Down set  */
#define PWR_PDCRA_PD6_Pos            (6U)
#define PWR_PDCRA_PD6_Msk            (0x1UL << PWR_PDCRA_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRA_PD6                PWR_PDCRA_PD6_Msk                         /*!< Port PA6 Pull-Down set  */
#define PWR_PDCRA_PD7_Pos            (7U)
#define PWR_PDCRA_PD7_Msk            (0x1UL << PWR_PDCRA_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRA_PD7                PWR_PDCRA_PD7_Msk                         /*!< Port PA7 Pull-Down set  */
#define PWR_PDCRA_PD8_Pos            (8U)
#define PWR_PDCRA_PD8_Msk            (0x1UL << PWR_PDCRA_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRA_PD8                PWR_PDCRA_PD8_Msk                         /*!< Port PA8 Pull-Down set  */
#define PWR_PDCRA_PD9_Pos            (9U)
#define PWR_PDCRA_PD9_Msk            (0x1UL << PWR_PDCRA_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRA_PD9                PWR_PDCRA_PD9_Msk                         /*!< Port PA9 Pull-Down set  */
#define PWR_PDCRA_PD10_Pos           (10U)
#define PWR_PDCRA_PD10_Msk           (0x1UL << PWR_PDCRA_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRA_PD10               PWR_PDCRA_PD10_Msk                        /*!< Port PA10 Pull-Down set */
#define PWR_PDCRA_PD11_Pos           (11U)
#define PWR_PDCRA_PD11_Msk           (0x1UL << PWR_PDCRA_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRA_PD11               PWR_PDCRA_PD11_Msk                        /*!< Port PA11 Pull-Down set */
#define PWR_PDCRA_PD12_Pos           (12U)
#define PWR_PDCRA_PD12_Msk           (0x1UL << PWR_PDCRA_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRA_PD12               PWR_PDCRA_PD12_Msk                        /*!< Port PA12 Pull-Down set */
#define PWR_PDCRA_PD13_Pos           (13U)
#define PWR_PDCRA_PD13_Msk           (0x1UL << PWR_PDCRA_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRA_PD13               PWR_PDCRA_PD13_Msk                        /*!< Port PA13 Pull-Down set */
#define PWR_PDCRA_PD14_Pos           (14U)
#define PWR_PDCRA_PD14_Msk           (0x1UL << PWR_PDCRA_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRA_PD14               PWR_PDCRA_PD14_Msk                        /*!< Port PA14 Pull-Down set */
#define PWR_PDCRA_PD15_Pos           (15U)
#define PWR_PDCRA_PD15_Msk           (0x1UL << PWR_PDCRA_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRA_PD15               PWR_PDCRA_PD15_Msk                        /*!< Port PA15 Pull-Down set */

/********************  Bit definition for PWR_PUCRB register  ********************/
#define PWR_PUCRB_PU0_Pos            (0U)
#define PWR_PUCRB_PU0_Msk            (0x1UL << PWR_PUCRB_PU0_Pos)              /*!< 0x00000001 */
#define PWR_PUCRB_PU0                PWR_PUCRB_PU0_Msk                         /*!< Port PB0 Pull-Up set  */
#define PWR_PUCRB_PU1_Pos            (1U)
#define PWR_PUCRB_PU1_Msk            (0x1UL << PWR_PUCRB_PU1_Pos)              /*!< 0x00000002 */
#define PWR_PUCRB_PU1                PWR_PUCRB_PU1_Msk                         /*!< Port PB1 Pull-Up set  */
#define PWR_PUCRB_PU2_Pos            (2U)
#define PWR_PUCRB_PU2_Msk            (0x1UL << PWR_PUCRB_PU2_Pos)              /*!< 0x00000004 */
#define PWR_PUCRB_PU2                PWR_PUCRB_PU2_Msk                         /*!< Port PB2 Pull-Up set  */
#define PWR_PUCRB_PU3_Pos            (3U)
#define PWR_PUCRB_PU3_Msk            (0x1UL << PWR_PUCRB_PU3_Pos)              /*!< 0x00000008 */
#define PWR_PUCRB_PU3                PWR_PUCRB_PU3_Msk                         /*!< Port PB3 Pull-Up set  */
#define PWR_PUCRB_PU4_Pos            (4U)
#define PWR_PUCRB_PU4_Msk            (0x1UL << PWR_PUCRB_PU4_Pos)              /*!< 0x00000010 */
#define PWR_PUCRB_PU4                PWR_PUCRB_PU4_Msk                         /*!< Port PB4 Pull-Up set  */
#define PWR_PUCRB_PU5_Pos            (5U)
#define PWR_PUCRB_PU5_Msk            (0x1UL << PWR_PUCRB_PU5_Pos)              /*!< 0x00000020 */
#define PWR_PUCRB_PU5                PWR_PUCRB_PU5_Msk                         /*!< Port PB5 Pull-Up set  */
#define PWR_PUCRB_PU6_Pos            (6U)
#define PWR_PUCRB_PU6_Msk            (0x1UL << PWR_PUCRB_PU6_Pos)              /*!< 0x00000040 */
#define PWR_PUCRB_PU6                PWR_PUCRB_PU6_Msk                         /*!< Port PB6 Pull-Up set  */
#define PWR_PUCRB_PU7_Pos            (7U)
#define PWR_PUCRB_PU7_Msk            (0x1UL << PWR_PUCRB_PU7_Pos)              /*!< 0x00000080 */
#define PWR_PUCRB_PU7                PWR_PUCRB_PU7_Msk                         /*!< Port PB7 Pull-Up set  */
#define PWR_PUCRB_PU8_Pos            (8U)
#define PWR_PUCRB_PU8_Msk            (0x1UL << PWR_PUCRB_PU8_Pos)              /*!< 0x00000100 */
#define PWR_PUCRB_PU8                PWR_PUCRB_PU8_Msk                         /*!< Port PB8 Pull-Up set  */
#define PWR_PUCRB_PU9_Pos            (9U)
#define PWR_PUCRB_PU9_Msk            (0x1UL << PWR_PUCRB_PU9_Pos)              /*!< 0x00000200 */
#define PWR_PUCRB_PU9                PWR_PUCRB_PU9_Msk                         /*!< Port PB9 Pull-Up set  */
#define PWR_PUCRB_PU10_Pos           (10U)
#define PWR_PUCRB_PU10_Msk           (0x1UL << PWR_PUCRB_PU10_Pos)             /*!< 0x00000400 */
#define PWR_PUCRB_PU10               PWR_PUCRB_PU10_Msk                        /*!< Port PB10 Pull-Up set */
#define PWR_PUCRB_PU11_Pos           (11U)
#define PWR_PUCRB_PU11_Msk           (0x1UL << PWR_PUCRB_PU11_Pos)             /*!< 0x00000800 */
#define PWR_PUCRB_PU11               PWR_PUCRB_PU11_Msk                        /*!< Port PB11 Pull-Up set */
#define PWR_PUCRB_PU12_Pos           (12U)
#define PWR_PUCRB_PU12_Msk           (0x1UL << PWR_PUCRB_PU12_Pos)             /*!< 0x00001000 */
#define PWR_PUCRB_PU12               PWR_PUCRB_PU12_Msk                        /*!< Port PB12 Pull-Up set */
#define PWR_PUCRB_PU13_Pos           (13U)
#define PWR_PUCRB_PU13_Msk           (0x1UL << PWR_PUCRB_PU13_Pos)             /*!< 0x00002000 */
#define PWR_PUCRB_PU13               PWR_PUCRB_PU13_Msk                        /*!< Port PB13 Pull-Up set */
#define PWR_PUCRB_PU14_Pos           (14U)
#define PWR_PUCRB_PU14_Msk           (0x1UL << PWR_PUCRB_PU14_Pos)             /*!< 0x00004000 */
#define PWR_PUCRB_PU14               PWR_PUCRB_PU14_Msk                        /*!< Port PB14 Pull-Up set */
#define PWR_PUCRB_PU15_Pos           (15U)
#define PWR_PUCRB_PU15_Msk           (0x1UL << PWR_PUCRB_PU15_Pos)             /*!< 0x00008000 */
#define PWR_PUCRB_PU15               PWR_PUCRB_PU15_Msk                        /*!< Port PB15 Pull-Up set */

/********************  Bit definition for PWR_PDCRB register  ********************/
#define PWR_PDCRB_PD0_Pos            (0U)
#define PWR_PDCRB_PD0_Msk            (0x1UL << PWR_PDCRB_PD0_Pos)              /*!< 0x00000001 */
#define PWR_PDCRB_PD0                PWR_PDCRB_PD0_Msk                         /*!< Port PB0 Pull-Down set  */
#define PWR_PDCRB_PD1_Pos            (1U)
#define PWR_PDCRB_PD1_Msk            (0x1UL << PWR_PDCRB_PD1_Pos)              /*!< 0x00000002 */
#define PWR_PDCRB_PD1                PWR_PDCRB_PD1_Msk                         /*!< Port PB1 Pull-Down set  */
#define PWR_PDCRB_PD2_Pos            (2U)
#define PWR_PDCRB_PD2_Msk            (0x1UL << PWR_PDCRB_PD2_Pos)              /*!< 0x00000004 */
#define PWR_PDCRB_PD2                PWR_PDCRB_PD2_Msk                         /*!< Port PB2 Pull-Down set  */
#define PWR_PDCRB_PD3_Pos            (3U)
#define PWR_PDCRB_PD3_Msk            (0x1UL << PWR_PDCRB_PD3_Pos)              /*!< 0x00000008 */
#define PWR_PDCRB_PD3                PWR_PDCRB_PD3_Msk                         /*!< Port PB3 Pull-Down set  */
#define PWR_PDCRB_PD4_Pos            (4U)
#define PWR_PDCRB_PD4_Msk            (0x1UL << PWR_PDCRB_PD4_Pos)              /*!< 0x00000010 */
#define PWR_PDCRB_PD4                PWR_PDCRB_PD4_Msk                         /*!< Port PB4 Pull-Down set  */
#define PWR_PDCRB_PD5_Pos            (5U)
#define PWR_PDCRB_PD5_Msk            (0x1UL << PWR_PDCRB_PD5_Pos)              /*!< 0x00000020 */
#define PWR_PDCRB_PD5                PWR_PDCRB_PD5_Msk                         /*!< Port PB5 Pull-Down set  */
#define PWR_PDCRB_PD6_Pos            (6U)
#define PWR_PDCRB_PD6_Msk            (0x1UL << PWR_PDCRB_PD6_Pos)              /*!< 0x00000040 */
#define PWR_PDCRB_PD6                PWR_PDCRB_PD6_Msk                         /*!< Port PB6 Pull-Down set  */
#define PWR_PDCRB_PD7_Pos            (7U)
#define PWR_PDCRB_PD7_Msk            (0x1UL << PWR_PDCRB_PD7_Pos)              /*!< 0x00000080 */
#define PWR_PDCRB_PD7                PWR_PDCRB_PD7_Msk                         /*!< Port PB7 Pull-Down set  */
#define PWR_PDCRB_PD8_Pos            (8U)
#define PWR_PDCRB_PD8_Msk            (0x1UL << PWR_PDCRB_PD8_Pos)              /*!< 0x00000100 */
#define PWR_PDCRB_PD8                PWR_PDCRB_PD8_Msk                         /*!< Port PB8 Pull-Down set  */
#define PWR_PDCRB_PD9_Pos            (9U)
#define PWR_PDCRB_PD9_Msk            (0x1UL << PWR_PDCRB_PD9_Pos)              /*!< 0x00000200 */
#define PWR_PDCRB_PD9                PWR_PDCRB_PD9_Msk                         /*!< Port PB9 Pull-Down set  */
#define PWR_PDCRB_PD10_Pos           (10U)
#define PWR_PDCRB_PD10_Msk           (0x1UL << PWR_PDCRB_PD10_Pos)             /*!< 0x00000400 */
#define PWR_PDCRB_PD10               PWR_PDCRB_PD10_Msk                        /*!< Port PB10 Pull-Down set */
#define PWR_PDCRB_PD11_Pos           (11U)
#define PWR_PDCRB_PD11_Msk           (0x1UL << PWR_PDCRB_PD11_Pos)             /*!< 0x00000800 */
#define PWR_PDCRB_PD11               PWR_PDCRB_PD11_Msk                        /*!< Port PB11 Pull-Down set */
#define PWR_PDCRB_PD12_Pos           (12U)
#define PWR_PDCRB_PD12_Msk           (0x1UL << PWR_PDCRB_PD12_Pos)             /*!< 0x00001000 */
#define PWR_PDCRB_PD12               PWR_PDCRB_PD12_Msk                        /*!< Port PB12 Pull-Down set */
#define PWR_PDCRB_PD13_Pos           (13U)
#define PWR_PDCRB_PD13_Msk           (0x1UL << PWR_PDCRB_PD13_Pos)             /*!< 0x00002000 */
#define PWR_PDCRB_PD13               PWR_PDCRB_PD13_Msk                        /*!< Port PB13 Pull-Down set */
#define PWR_PDCRB_PD14_Pos           (14U)
#define PWR_PDCRB_PD14_Msk           (0x1UL << PWR_PDCRB_PD14_Pos)             /*!< 0x00004000 */
#define PWR_PDCRB_PD14               PWR_PDCRB_PD14_Msk                        /*!< Port PB14 Pull-Down set */
#define PWR_PDCRB_PD15_Pos           (15U)
#define PWR_PDCRB_PD15_Msk           (0x1UL << PWR_PDCRB_PD15_Pos)             /*!< 0x00008000 */
#define PWR_PDCRB_PD15               PWR_PDCRB_PD15_Msk                        /*!< Port PB15 Pull-Down set */

