ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l562xx.h
#define TIM8_OR2_ETRSEL_Pos       (14U)
#define TIM8_OR2_ETRSEL_Msk       (0x7UL << TIM8_OR2_ETRSEL_Pos)               /*!< 0x0001C000 */
#define TIM8_OR2_ETRSEL           TIM8_OR2_ETRSEL_Msk                          /*!<ETRSEL[2:0] bits (TIM8 ETR source selection) */
#define TIM8_OR2_ETRSEL_0         (0x1UL << TIM8_OR2_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM8_OR2_ETRSEL_1         (0x2UL << TIM8_OR2_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM8_OR2_ETRSEL_2         (0x4UL << TIM8_OR2_ETRSEL_Pos)               /*!< 0x00010000 */

/*******************  Bit definition for TIM8_OR3 register  *******************/
#define TIM8_OR3_BK2INE_Pos       (0U)
#define TIM8_OR3_BK2INE_Msk       (0x1UL << TIM8_OR3_BK2INE_Pos)               /*!< 0x00000001 */
#define TIM8_OR3_BK2INE           TIM8_OR3_BK2INE_Msk                          /*!<BRK2 BKIN2 input enable */
#define TIM8_OR3_BK2CMP1E_Pos     (1U)
#define TIM8_OR3_BK2CMP1E_Msk     (0x1UL << TIM8_OR3_BK2CMP1E_Pos)             /*!< 0x00000002 */
#define TIM8_OR3_BK2CMP1E         TIM8_OR3_BK2CMP1E_Msk                        /*!<BRK2 COMP1 enable */
#define TIM8_OR3_BK2CMP2E_Pos     (2U)
#define TIM8_OR3_BK2CMP2E_Msk     (0x1UL << TIM8_OR3_BK2CMP2E_Pos)             /*!< 0x00000004 */
#define TIM8_OR3_BK2CMP2E         TIM8_OR3_BK2CMP2E_Msk                        /*!<BRK2 COMP2 enable */
#define TIM8_OR3_BK2DF1BK3E_Pos   (8U)
#define TIM8_OR3_BK2DF1BK3E_Msk   (0x1UL << TIM8_OR3_BK2DF1BK3E_Pos)           /*!< 0x00000100 */
#define TIM8_OR3_BK2DF1BK3E       TIM8_OR3_BK2DF1BK3E_Msk                      /*!<BRK2 DFSDM1_BREAK[3] enable */
#define TIM8_OR3_BK2INP_Pos       (9U)
#define TIM8_OR3_BK2INP_Msk       (0x1UL << TIM8_OR3_BK2INP_Pos)               /*!< 0x00000200 */
#define TIM8_OR3_BK2INP           TIM8_OR3_BK2INP_Msk                          /*!<BRK2 BKIN2 input polarity */
#define TIM8_OR3_BK2CMP1P_Pos     (10U)
#define TIM8_OR3_BK2CMP1P_Msk     (0x1UL << TIM8_OR3_BK2CMP1P_Pos)             /*!< 0x00000400 */
#define TIM8_OR3_BK2CMP1P         TIM8_OR3_BK2CMP1P_Msk                        /*!<BRK2 COMP1 input polarity */
#define TIM8_OR3_BK2CMP2P_Pos     (11U)
#define TIM8_OR3_BK2CMP2P_Msk     (0x1UL << TIM8_OR3_BK2CMP2P_Pos)             /*!< 0x00000800 */
#define TIM8_OR3_BK2CMP2P         TIM8_OR3_BK2CMP2P_Msk                        /*!<BRK2 COMP2 input polarity */

/*******************  Bit definition for TIM2_OR1 register  *******************/
#define TIM2_OR1_ITR1_RMP_Pos     (0U)
#define TIM2_OR1_ITR1_RMP_Msk     (0x1UL << TIM2_OR1_ITR1_RMP_Pos)             /*!< 0x00000001 */
#define TIM2_OR1_ITR1_RMP         TIM2_OR1_ITR1_RMP_Msk                        /*!<TIM2 Internal trigger 1 remap */
#define TIM2_OR1_ETR1_RMP_Pos     (1U)
#define TIM2_OR1_ETR1_RMP_Msk     (0x1UL << TIM2_OR1_ETR1_RMP_Pos)             /*!< 0x00000002 */
#define TIM2_OR1_ETR1_RMP         TIM2_OR1_ETR1_RMP_Msk                        /*!<TIM2 External trigger 1 remap */

#define TIM2_OR1_TI4_RMP_Pos      (2U)
#define TIM2_OR1_TI4_RMP_Msk      (0x3UL << TIM2_OR1_TI4_RMP_Pos)              /*!< 0x0000000C */
#define TIM2_OR1_TI4_RMP          TIM2_OR1_TI4_RMP_Msk                         /*!<TI4_RMP[1:0] bits (TIM2 Input Capture 4 remap) */
#define TIM2_OR1_TI4_RMP_0        (0x1UL << TIM2_OR1_TI4_RMP_Pos)              /*!< 0x00000004 */
#define TIM2_OR1_TI4_RMP_1        (0x2UL << TIM2_OR1_TI4_RMP_Pos)              /*!< 0x00000008 */

/*******************  Bit definition for TIM2_OR2 register  *******************/
#define TIM2_OR2_ETRSEL_Pos       (14U)
#define TIM2_OR2_ETRSEL_Msk       (0x7UL << TIM2_OR2_ETRSEL_Pos)               /*!< 0x0001C000 */
#define TIM2_OR2_ETRSEL           TIM2_OR2_ETRSEL_Msk                          /*!<ETRSEL[2:0] bits (TIM2 ETR source selection) */
#define TIM2_OR2_ETRSEL_0         (0x1UL << TIM2_OR2_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM2_OR2_ETRSEL_1         (0x2UL << TIM2_OR2_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM2_OR2_ETRSEL_2         (0x4UL << TIM2_OR2_ETRSEL_Pos)               /*!< 0x00010000 */

/*******************  Bit definition for TIM3_OR1 register  *******************/
#define TIM3_OR1_TI1_RMP_Pos      (0U)
#define TIM3_OR1_TI1_RMP_Msk      (0x3UL << TIM3_OR1_TI1_RMP_Pos)              /*!< 0x00000003 */
#define TIM3_OR1_TI1_RMP          TIM3_OR1_TI1_RMP_Msk                         /*!<TI1_RMP[1:0] bits (TIM3 Input Capture 1 remap) */
#define TIM3_OR1_TI1_RMP_0        (0x1UL << TIM3_OR1_TI1_RMP_Pos)              /*!< 0x00000001 */
#define TIM3_OR1_TI1_RMP_1        (0x2UL << TIM3_OR1_TI1_RMP_Pos)              /*!< 0x00000002 */

/*******************  Bit definition for TIM3_OR2 register  *******************/
#define TIM3_OR2_ETRSEL_Pos       (14U)
#define TIM3_OR2_ETRSEL_Msk       (0x7UL << TIM3_OR2_ETRSEL_Pos)               /*!< 0x0001C000 */
#define TIM3_OR2_ETRSEL           TIM3_OR2_ETRSEL_Msk                          /*!<ETRSEL[2:0] bits (TIM3 ETR source selection) */
#define TIM3_OR2_ETRSEL_0         (0x1UL << TIM3_OR2_ETRSEL_Pos)               /*!< 0x00004000 */
#define TIM3_OR2_ETRSEL_1         (0x2UL << TIM3_OR2_ETRSEL_Pos)               /*!< 0x00008000 */
#define TIM3_OR2_ETRSEL_2         (0x4UL << TIM3_OR2_ETRSEL_Pos)               /*!< 0x00010000 */

/*******************  Bit definition for TIM15_OR1 register  ******************/
#define TIM15_OR1_TI1_RMP_Pos     (0U)
#define TIM15_OR1_TI1_RMP_Msk     (0x1UL << TIM15_OR1_TI1_RMP_Pos)             /*!< 0x00000001 */
#define TIM15_OR1_TI1_RMP         TIM15_OR1_TI1_RMP_Msk                        /*!<TIM15 Input Capture 1 remap */

#define TIM15_OR1_ENCODER_MODE_Pos (1U)
#define TIM15_OR1_ENCODER_MODE_Msk (0x3UL << TIM15_OR1_ENCODER_MODE_Pos)       /*!< 0x00000006 */
#define TIM15_OR1_ENCODER_MODE     TIM15_OR1_ENCODER_MODE_Msk                  /*!<ENCODER_MODE[1:0] bits (TIM15 Encoder mode) */
#define TIM15_OR1_ENCODER_MODE_0   (0x1UL << TIM15_OR1_ENCODER_MODE_Pos)       /*!< 0x00000002 */
#define TIM15_OR1_ENCODER_MODE_1   (0x2UL << TIM15_OR1_ENCODER_MODE_Pos)       /*!< 0x00000004 */

/*******************  Bit definition for TIM15_OR2 register  ******************/
#define TIM15_OR2_BKINE_Pos       (0U)
#define TIM15_OR2_BKINE_Msk       (0x1UL << TIM15_OR2_BKINE_Pos)               /*!< 0x00000001 */
#define TIM15_OR2_BKINE           TIM15_OR2_BKINE_Msk                          /*!<BRK BKIN input enable */
#define TIM15_OR2_BKCMP1E_Pos     (1U)
#define TIM15_OR2_BKCMP1E_Msk     (0x1UL << TIM15_OR2_BKCMP1E_Pos)             /*!< 0x00000002 */
#define TIM15_OR2_BKCMP1E         TIM15_OR2_BKCMP1E_Msk                        /*!<BRK COMP1 enable */
#define TIM15_OR2_BKCMP2E_Pos     (2U)
#define TIM15_OR2_BKCMP2E_Msk     (0x1UL << TIM15_OR2_BKCMP2E_Pos)             /*!< 0x00000004 */
#define TIM15_OR2_BKCMP2E         TIM15_OR2_BKCMP2E_Msk                        /*!<BRK COMP2 enable */
#define TIM15_OR2_BKDF1BK0E_Pos   (8U)
#define TIM15_OR2_BKDF1BK0E_Msk   (0x1UL << TIM15_OR2_BKDF1BK0E_Pos)           /*!< 0x00000100 */
#define TIM15_OR2_BKDF1BK0E       TIM15_OR2_BKDF1BK0E_Msk                      /*!<BRK DFSDM1_BREAK[0] enable */
#define TIM15_OR2_BKINP_Pos       (9U)
#define TIM15_OR2_BKINP_Msk       (0x1UL << TIM15_OR2_BKINP_Pos)               /*!< 0x00000200 */
#define TIM15_OR2_BKINP           TIM15_OR2_BKINP_Msk                          /*!<BRK BKIN input polarity */
#define TIM15_OR2_BKCMP1P_Pos     (10U)
#define TIM15_OR2_BKCMP1P_Msk     (0x1UL << TIM15_OR2_BKCMP1P_Pos)             /*!< 0x00000400 */
#define TIM15_OR2_BKCMP1P         TIM15_OR2_BKCMP1P_Msk                        /*!<BRK COMP1 input polarity */
#define TIM15_OR2_BKCMP2P_Pos     (11U)
#define TIM15_OR2_BKCMP2P_Msk     (0x1UL << TIM15_OR2_BKCMP2P_Pos)             /*!< 0x00000800 */
#define TIM15_OR2_BKCMP2P         TIM15_OR2_BKCMP2P_Msk                        /*!<BRK COMP2 input polarity */

