ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32L5xx/stm32l562xx.h
/*******************  Bits definition for GTZC_TZSC_SECCFGR2 register  ***************/
#define GTZC_TZSC_SECCFGR2_OCTOSPI1_REGSEC_Pos   GTZC_CFGR2_OCTOSPI1_REG_Pos
#define GTZC_TZSC_SECCFGR2_OCTOSPI1_REGSEC_Msk   GTZC_CFGR2_OCTOSPI1_REG_Msk
#define GTZC_TZSC_SECCFGR2_FMC_REGSEC_Pos        GTZC_CFGR2_FMC_REG_Pos
#define GTZC_TZSC_SECCFGR2_FMC_REGSEC_Msk        GTZC_CFGR2_FMC_REG_Msk
#define GTZC_TZSC_SECCFGR2_SDMMC1SEC_Pos         GTZC_CFGR2_SDMMC1_Pos
#define GTZC_TZSC_SECCFGR2_SDMMC1SEC_Msk         GTZC_CFGR2_SDMMC1_Msk
#define GTZC_TZSC_SECCFGR2_PKASEC_Pos            GTZC_CFGR2_PKA_Pos
#define GTZC_TZSC_SECCFGR2_PKASEC_Msk            GTZC_CFGR2_PKA_Msk
#define GTZC_TZSC_SECCFGR2_RNGSEC_Pos            GTZC_CFGR2_RNG_Pos
#define GTZC_TZSC_SECCFGR2_RNGSEC_Msk            GTZC_CFGR2_RNG_Msk
#define GTZC_TZSC_SECCFGR2_HASHSEC_Pos           GTZC_CFGR2_HASH_Pos
#define GTZC_TZSC_SECCFGR2_HASHSEC_Msk           GTZC_CFGR2_HASH_Msk
#define GTZC_TZSC_SECCFGR2_AESSEC_Pos            GTZC_CFGR2_AES_Pos
#define GTZC_TZSC_SECCFGR2_AESSEC_Msk            GTZC_CFGR2_AES_Msk
#define GTZC_TZSC_SECCFGR2_ADCSEC_Pos            GTZC_CFGR2_ADC_Pos
#define GTZC_TZSC_SECCFGR2_ADCSEC_Msk            GTZC_CFGR2_ADC_Msk
#define GTZC_TZSC_SECCFGR2_ICACHE_REGSEC_Pos     GTZC_CFGR2_ICACHE_REG_Pos
#define GTZC_TZSC_SECCFGR2_ICACHE_REGSEC_Msk     GTZC_CFGR2_ICACHE_REG_Msk
#define GTZC_TZSC_SECCFGR2_TSCSEC_Pos            GTZC_CFGR2_TSC_Pos
#define GTZC_TZSC_SECCFGR2_TSCSEC_Msk            GTZC_CFGR2_TSC_Msk
#define GTZC_TZSC_SECCFGR2_CRCSEC_Pos            GTZC_CFGR2_CRC_Pos
#define GTZC_TZSC_SECCFGR2_CRCSEC_Msk            GTZC_CFGR2_CRC_Msk
#define GTZC_TZSC_SECCFGR2_DFSDM1SEC_Pos         GTZC_CFGR2_DFSDM1_Pos
#define GTZC_TZSC_SECCFGR2_DFSDM1SEC_Msk         GTZC_CFGR2_DFSDM1_Msk
#define GTZC_TZSC_SECCFGR2_SAI2SEC_Pos           GTZC_CFGR2_SAI2_Pos
#define GTZC_TZSC_SECCFGR2_SAI2SEC_Msk           GTZC_CFGR2_SAI2_Msk
#define GTZC_TZSC_SECCFGR2_SAI1SEC_Pos           GTZC_CFGR2_SAI1_Pos
#define GTZC_TZSC_SECCFGR2_SAI1SEC_Msk           GTZC_CFGR2_SAI1_Msk
#define GTZC_TZSC_SECCFGR2_TIM17SEC_Pos          GTZC_CFGR2_TIM17_Pos
#define GTZC_TZSC_SECCFGR2_TIM17SEC_Msk          GTZC_CFGR2_TIM17_Msk
#define GTZC_TZSC_SECCFGR2_TIM16SEC_Pos          GTZC_CFGR2_TIM16_Pos
#define GTZC_TZSC_SECCFGR2_TIM16SEC_Msk          GTZC_CFGR2_TIM16_Msk
#define GTZC_TZSC_SECCFGR2_TIM15SEC_Pos          GTZC_CFGR2_TIM15_Pos
#define GTZC_TZSC_SECCFGR2_TIM15SEC_Msk          GTZC_CFGR2_TIM15_Msk
#define GTZC_TZSC_SECCFGR2_USART1SEC_Pos         GTZC_CFGR2_USART1_Pos
#define GTZC_TZSC_SECCFGR2_USART1SEC_Msk         GTZC_CFGR2_USART1_Msk
#define GTZC_TZSC_SECCFGR2_TIM8SEC_Pos           GTZC_CFGR2_TIM8_Pos
#define GTZC_TZSC_SECCFGR2_TIM8SEC_Msk           GTZC_CFGR2_TIM8_Msk

/*******************  Bits definition for GTZC_TZSC_PRIVCFGR1 register  ***************/
#define GTZC_TZSC_PRIVCFGR1_SPI1PRIV_Pos         GTZC_CFGR1_SPI1_Pos
#define GTZC_TZSC_PRIVCFGR1_SPI1PRIV_Msk         GTZC_CFGR1_SPI1_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM1PRIV_Pos         GTZC_CFGR1_TIM1_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM1PRIV_Msk         GTZC_CFGR1_TIM1_Msk
#define GTZC_TZSC_PRIVCFGR1_COMPPRIV_Pos         GTZC_CFGR1_COMP_Pos
#define GTZC_TZSC_PRIVCFGR1_COMPPRIV_Msk         GTZC_CFGR1_COMP_Msk
#define GTZC_TZSC_PRIVCFGR1_VREFBUFPRIV_Pos      GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZSC_PRIVCFGR1_VREFBUFPRIV_Msk      GTZC_CFGR1_VREFBUF_Msk
#define GTZC_TZSC_PRIVCFGR1_UCPD1PRIV_Pos        GTZC_CFGR1_UCPD1_Pos
#define GTZC_TZSC_PRIVCFGR1_UCPD1PRIV_Msk        GTZC_CFGR1_UCPD1_Msk
#define GTZC_TZSC_PRIVCFGR1_USBFSPRIV_Pos        GTZC_CFGR1_USBFS_Pos
#define GTZC_TZSC_PRIVCFGR1_USBFSPRIV_Msk        GTZC_CFGR1_USBFS_Msk
#define GTZC_TZSC_PRIVCFGR1_FDCAN1PRIV_Pos       GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZSC_PRIVCFGR1_FDCAN1PRIV_Msk       GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZSC_PRIVCFGR1_LPTIM3PRIV_Pos       GTZC_CFGR1_LPTIM3_Pos
#define GTZC_TZSC_PRIVCFGR1_LPTIM3PRIV_Msk       GTZC_CFGR1_LPTIM3_Msk
#define GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Pos       GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZSC_PRIVCFGR1_LPTIM2PRIV_Msk       GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Pos         GTZC_CFGR1_I2C4_Pos
#define GTZC_TZSC_PRIVCFGR1_I2C4PRIV_Msk         GTZC_CFGR1_I2C4_Msk
#define GTZC_TZSC_PRIVCFGR1_LPUART1PRIV_Pos      GTZC_CFGR1_LPUART1_Pos
#define GTZC_TZSC_PRIVCFGR1_LPUART1PRIV_Msk      GTZC_CFGR1_LPUART1_Msk
#define GTZC_TZSC_PRIVCFGR1_LPTIM1PRIV_Pos       GTZC_CFGR1_LPTIM1_Pos
#define GTZC_TZSC_PRIVCFGR1_LPTIM1PRIV_Msk       GTZC_CFGR1_LPTIM1_Msk
#define GTZC_TZSC_PRIVCFGR1_OPAMPPRIV_Pos        GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZSC_PRIVCFGR1_OPAMPPRIV_Msk        GTZC_CFGR1_OPAMP_Msk
#define GTZC_TZSC_PRIVCFGR1_DAC1PRIV_Pos         GTZC_CFGR1_DAC1_Pos
#define GTZC_TZSC_PRIVCFGR1_DAC1PRIV_Msk         GTZC_CFGR1_DAC1_Msk
#define GTZC_TZSC_PRIVCFGR1_CRSPRIV_Pos          GTZC_CFGR1_CRS_Pos
#define GTZC_TZSC_PRIVCFGR1_CRSPRIV_Msk          GTZC_CFGR1_CRS_Msk
#define GTZC_TZSC_PRIVCFGR1_I2C3PRIV_Pos         GTZC_CFGR1_I2C3_Pos
#define GTZC_TZSC_PRIVCFGR1_I2C3PRIV_Msk         GTZC_CFGR1_I2C3_Msk
#define GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Pos         GTZC_CFGR1_I2C2_Pos
#define GTZC_TZSC_PRIVCFGR1_I2C2PRIV_Msk         GTZC_CFGR1_I2C2_Msk
#define GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Pos         GTZC_CFGR1_I2C1_Pos
#define GTZC_TZSC_PRIVCFGR1_I2C1PRIV_Msk         GTZC_CFGR1_I2C1_Msk
#define GTZC_TZSC_PRIVCFGR1_UART5PRIV_Pos        GTZC_CFGR1_UART5_Pos
#define GTZC_TZSC_PRIVCFGR1_UART5PRIV_Msk        GTZC_CFGR1_UART5_Msk
#define GTZC_TZSC_PRIVCFGR1_UART4PRIV_Pos        GTZC_CFGR1_UART4_Pos
#define GTZC_TZSC_PRIVCFGR1_UART4PRIV_Msk        GTZC_CFGR1_UART4_Msk
#define GTZC_TZSC_PRIVCFGR1_USART3PRIV_Pos       GTZC_CFGR1_USART3_Pos
#define GTZC_TZSC_PRIVCFGR1_USART3PRIV_Msk       GTZC_CFGR1_USART3_Msk
#define GTZC_TZSC_PRIVCFGR1_USART2PRIV_Pos       GTZC_CFGR1_USART2_Pos
#define GTZC_TZSC_PRIVCFGR1_USART2PRIV_Msk       GTZC_CFGR1_USART2_Msk
#define GTZC_TZSC_PRIVCFGR1_SPI3PRIV_Pos         GTZC_CFGR1_PI3_Pos
#define GTZC_TZSC_PRIVCFGR1_SPI3PRIV_Msk         GTZC_CFGR1_SPI3_Msk
#define GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Pos         GTZC_CFGR1_SPI2_Pos
#define GTZC_TZSC_PRIVCFGR1_SPI2PRIV_Msk         GTZC_CFGR1_SPI2_Msk
#define GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Pos         GTZC_CFGR1_IWDG_Pos
#define GTZC_TZSC_PRIVCFGR1_IWDGPRIV_Msk         GTZC_CFGR1_IWDG_Msk
#define GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Pos         GTZC_CFGR1_WWDG_Pos
#define GTZC_TZSC_PRIVCFGR1_WWDGPRIV_Msk         GTZC_CFGR1_WWDG_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM7PRIV_Pos         GTZC_CFGR1_TIM7_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM7PRIV_Msk         GTZC_CFGR1_TIM7_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM6PRIV_Pos         GTZC_CFGR1_TIM6_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM6PRIV_Msk         GTZC_CFGR1_TIM6_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM5PRIV_Pos         GTZC_CFGR1_TIM5_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM5PRIV_Msk         GTZC_CFGR1_TIM5_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Pos         GTZC_CFGR1_TIM4_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM4PRIV_Msk         GTZC_CFGR1_TIM4_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Pos         GTZC_CFGR1_TIM3_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM3PRIV_Msk         GTZC_CFGR1_TIM3_Msk
#define GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Pos         GTZC_CFGR1_TIM2_Pos
#define GTZC_TZSC_PRIVCFGR1_TIM2PRIV_Msk         GTZC_CFGR1_TIM2_Msk

/*******************  Bits definition for GTZC_TZSC_PRIVCFGR2 register  ***************/
#define GTZC_TZSC_PRIVCFGR2_OCTOSPI1_REGPRIV_Pos GTZC_CFGR2_OCTOSPI1_REG_Pos
#define GTZC_TZSC_PRIVCFGR2_OCTOSPI1_REGPRIV_Msk GTZC_CFGR2_OCTOSPI1_REG_Msk
#define GTZC_TZSC_PRIVCFGR2_FMC_REGPRIV_Pos      GTZC_CFGR2_FMC_REG_Pos
#define GTZC_TZSC_PRIVCFGR2_FMC_REGPRIV_Msk      GTZC_CFGR2_FMC_REG_Msk
#define GTZC_TZSC_PRIVCFGR2_SDMMC1PRIV_Pos       GTZC_CFGR2_SDMMC1_Pos
#define GTZC_TZSC_PRIVCFGR2_SDMMC1PRIV_Msk       GTZC_CFGR2_SDMMC1_Msk
#define GTZC_TZSC_PRIVCFGR2_PKAPRIV_Pos          GTZC_CFGR2_PKA_Pos
#define GTZC_TZSC_PRIVCFGR2_PKAPRIV_Msk          GTZC_CFGR2_PKA_Msk
#define GTZC_TZSC_PRIVCFGR2_RNGPRIV_Pos          GTZC_CFGR2_RNG_Pos
#define GTZC_TZSC_PRIVCFGR2_RNGPRIV_Msk          GTZC_CFGR2_RNG_Msk
#define GTZC_TZSC_PRIVCFGR2_HASHPRIV_Pos         GTZC_CFGR2_HASH_Pos
#define GTZC_TZSC_PRIVCFGR2_HASHPRIV_Msk         GTZC_CFGR2_HASH_Msk
#define GTZC_TZSC_PRIVCFGR2_AESPRIV_Pos          GTZC_CFGR2_AES_Pos
#define GTZC_TZSC_PRIVCFGR2_AESPRIV_Msk          GTZC_CFGR2_AES_Msk
#define GTZC_TZSC_PRIVCFGR2_ADCPRIV_Pos          GTZC_CFGR2_ADC_Pos
#define GTZC_TZSC_PRIVCFGR2_ADCPRIV_Msk          GTZC_CFGR2_ADC_Msk
#define GTZC_TZSC_PRIVCFGR2_ICACHE_REGPRIV_Pos   GTZC_CFGR2_ICACHE_REG_Pos
#define GTZC_TZSC_PRIVCFGR2_ICACHE_REGPRIV_Msk   GTZC_CFGR2_ICACHE_REG_Msk
#define GTZC_TZSC_PRIVCFGR2_TSCPRIV_Pos          GTZC_CFGR2_TSC_Pos
#define GTZC_TZSC_PRIVCFGR2_TSCPRIV_Msk          GTZC_CFGR2_TSC_Msk
#define GTZC_TZSC_PRIVCFGR2_CRCPRIV_Pos          GTZC_CFGR2_CRC_Pos
#define GTZC_TZSC_PRIVCFGR2_CRCPRIV_Msk          GTZC_CFGR2_CRC_Msk
#define GTZC_TZSC_PRIVCFGR2_DFSDM1PRIV_Pos       GTZC_CFGR2_DFSDM1_Pos
#define GTZC_TZSC_PRIVCFGR2_DFSDM1PRIV_Msk       GTZC_CFGR2_DFSDM1_Msk
#define GTZC_TZSC_PRIVCFGR2_SAI2PRIV_Pos         GTZC_CFGR2_SAI2_Pos
#define GTZC_TZSC_PRIVCFGR2_SAI2PRIV_Msk         GTZC_CFGR2_SAI2_Msk
#define GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Pos         GTZC_CFGR2_SAI1_Pos
#define GTZC_TZSC_PRIVCFGR2_SAI1PRIV_Msk         GTZC_CFGR2_SAI1_Msk
#define GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Pos        GTZC_CFGR2_TIM17_Pos
#define GTZC_TZSC_PRIVCFGR2_TIM17PRIV_Msk        GTZC_CFGR2_TIM17_Msk
#define GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Pos        GTZC_CFGR2_TIM16_Pos
#define GTZC_TZSC_PRIVCFGR2_TIM16PRIV_Msk        GTZC_CFGR2_TIM16_Msk
#define GTZC_TZSC_PRIVCFGR2_TIM15PRIV_Pos        GTZC_CFGR2_TIM15_Pos
#define GTZC_TZSC_PRIVCFGR2_TIM15PRIV_Msk        GTZC_CFGR2_TIM15_Msk
#define GTZC_TZSC_PRIVCFGR2_USART1PRIV_Pos       GTZC_CFGR2_USART1_Pos
#define GTZC_TZSC_PRIVCFGR2_USART1PRIV_Msk       GTZC_CFGR2_USART1_Msk
#define GTZC_TZSC_PRIVCFGR2_TIM8PRIV_Pos         GTZC_CFGR2_TIM8_Pos
#define GTZC_TZSC_PRIVCFGR2_TIM8PRIV_Msk         GTZC_CFGR2_TIM8_Msk

/*******************  Bits definition for GTZC_TZIC_IER1 register  ***************/
#define GTZC_TZIC_IER1_SPI1IE_Pos                GTZC_CFGR1_SPI1_Pos
#define GTZC_TZIC_IER1_SPI1IE_Msk                GTZC_CFGR1_SPI1_Msk
#define GTZC_TZIC_IER1_TIM1IE_Pos                GTZC_CFGR1_TIM1_Pos
#define GTZC_TZIC_IER1_TIM1IE_Msk                GTZC_CFGR1_TIM1_Msk
#define GTZC_TZIC_IER1_COMPIE_Pos                GTZC_CFGR1_COMP_Pos
#define GTZC_TZIC_IER1_COMPIE_Msk                GTZC_CFGR1_COMP_Msk
#define GTZC_TZIC_IER1_VREFBUFIE_Pos             GTZC_CFGR1_VREFBUF_Pos
#define GTZC_TZIC_IER1_VREFBUFIE_Msk             GTZC_CFGR1_VREFBUF_Msk
#define GTZC_TZIC_IER1_UCPD1IE_Pos               GTZC_CFGR1_UCPD1_Pos
#define GTZC_TZIC_IER1_UCPD1IE_Msk               GTZC_CFGR1_UCPD1_Msk
#define GTZC_TZIC_IER1_USBFSIE_Pos               GTZC_CFGR1_USBFS_Pos
#define GTZC_TZIC_IER1_USBFSIE_Msk               GTZC_CFGR1_USBFS_Msk
#define GTZC_TZIC_IER1_FDCAN1IE_Pos              GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC_IER1_FDCAN1IE_Msk              GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZIC_IER1_LPTIM3IE_Pos              GTZC_CFGR1_LPTIM3_Pos
#define GTZC_TZIC_IER1_LPTIM3IE_Msk              GTZC_CFGR1_LPTIM3_Msk
#define GTZC_TZIC_IER1_LPTIM2IE_Pos              GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC_IER1_LPTIM2IE_Msk              GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZIC_IER1_I2C4IE_Pos                GTZC_CFGR1_I2C4_Pos
#define GTZC_TZIC_IER1_I2C4IE_Msk                GTZC_CFGR1_I2C4_Msk
#define GTZC_TZIC_IER1_LPUART1IE_Pos             GTZC_CFGR1_LPUART1_Pos
#define GTZC_TZIC_IER1_LPUART1IE_Msk             GTZC_CFGR1_LPUART1_Msk
#define GTZC_TZIC_IER1_LPTIM1IE_Pos              GTZC_CFGR1_LPTIM1_Pos
#define GTZC_TZIC_IER1_LPTIM1IE_Msk              GTZC_CFGR1_LPTIM1_Msk
#define GTZC_TZIC_IER1_OPAMPIE_Pos               GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC_IER1_OPAMPIE_Msk               GTZC_CFGR1_OPAMP_Msk
#define GTZC_TZIC_IER1_DAC1IE_Pos                GTZC_CFGR1_DAC1_Pos
#define GTZC_TZIC_IER1_DAC1IE_Msk                GTZC_CFGR1_DAC1_Msk
#define GTZC_TZIC_IER1_CRSIE_Pos                 GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC_IER1_CRSIE_Msk                 GTZC_CFGR1_CRS_Msk
#define GTZC_TZIC_IER1_I2C3IE_Pos                GTZC_CFGR1_I2C3_Pos
#define GTZC_TZIC_IER1_I2C3IE_Msk                GTZC_CFGR1_I2C3_Msk
#define GTZC_TZIC_IER1_I2C2IE_Pos                GTZC_CFGR1_I2C2_Pos
#define GTZC_TZIC_IER1_I2C2IE_Msk                GTZC_CFGR1_I2C2_Msk
#define GTZC_TZIC_IER1_I2C1IE_Pos                GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC_IER1_I2C1IE_Msk                GTZC_CFGR1_I2C1_Msk
#define GTZC_TZIC_IER1_UART5IE_Pos               GTZC_CFGR1_UART5_Pos
#define GTZC_TZIC_IER1_UART5IE_Msk               GTZC_CFGR1_UART5_Msk
#define GTZC_TZIC_IER1_UART4IE_Pos               GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC_IER1_UART4IE_Msk               GTZC_CFGR1_UART4_Msk
#define GTZC_TZIC_IER1_USART3IE_Pos              GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC_IER1_USART3IE_Msk              GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC_IER1_USART2IE_Pos              GTZC_CFGR1_USART2_Pos
#define GTZC_TZIC_IER1_USART2IE_Msk              GTZC_CFGR1_USART2_Msk
#define GTZC_TZIC_IER1_SPI3IE_Pos                GTZC_CFGR1_SPI3_Pos
#define GTZC_TZIC_IER1_SPI3IE_Msk                GTZC_CFGR1_SPI3_Msk
#define GTZC_TZIC_IER1_SPI2IE_Pos                GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC_IER1_SPI2IE_Msk                GTZC_CFGR1_SPI2_Msk
#define GTZC_TZIC_IER1_IWDGIE_Pos                GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC_IER1_IWDGIE_Msk                GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC_IER1_WWDGIE_Pos                GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC_IER1_WWDGIE_Msk                GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC_IER1_TIM7IE_Pos                GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC_IER1_TIM7IE_Msk                GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC_IER1_TIM6IE_Pos                GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC_IER1_TIM6IE_Msk                GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC_IER1_TIM5IE_Pos                GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC_IER1_TIM5IE_Msk                GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC_IER1_TIM4IE_Pos                GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC_IER1_TIM4IE_Msk                GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC_IER1_TIM3IE_Pos                GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC_IER1_TIM3IE_Msk                GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC_IER1_TIM2IE_Pos                GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC_IER1_TIM2IE_Msk                GTZC_CFGR1_TIM2_Msk

/*******************  Bits definition for GTZC_TZIC_IER2 register  ***************/
#define GTZC_TZIC_IER2_OTFDEC1IE_Pos             GTZC_CFGR2_OTFDEC1_Pos
#define GTZC_TZIC_IER2_OTFDEC1IE_Msk             GTZC_CFGR2_OTFDEC1_Msk
#define GTZC_TZIC_IER2_EXTIIE_Pos                GTZC_CFGR2_EXTI_Pos
#define GTZC_TZIC_IER2_EXTIIE_Msk                GTZC_CFGR2_EXTI_Msk
#define GTZC_TZIC_IER2_FLASH_REGIE_Pos           GTZC_CFGR2_FLASH_REG_Pos
#define GTZC_TZIC_IER2_FLASH_REGIE_Msk           GTZC_CFGR2_FLASH_REG_Msk
#define GTZC_TZIC_IER2_FLASHIE_Pos               GTZC_CFGR2_FLASH_Pos
#define GTZC_TZIC_IER2_FLASHIE_Msk               GTZC_CFGR2_FLASH_Msk
#define GTZC_TZIC_IER2_RCCIE_Pos                 GTZC_CFGR2_RCC_Pos
#define GTZC_TZIC_IER2_RCCIE_Msk                 GTZC_CFGR2_RCC_Msk
#define GTZC_TZIC_IER2_DMAMUX1IE_Pos             GTZC_CFGR2_DMAMUX1_Pos
#define GTZC_TZIC_IER2_DMAMUX1IE_Msk             GTZC_CFGR2_DMAMUX1_Msk
#define GTZC_TZIC_IER2_DMA2IE_Pos                GTZC_CFGR2_DMA2_Pos
#define GTZC_TZIC_IER2_DMA2IE_Msk                GTZC_CFGR2_DMA2_Msk
#define GTZC_TZIC_IER2_DMA1IE_Pos                GTZC_CFGR2_DMA1_Pos
#define GTZC_TZIC_IER2_DMA1IE_Msk                GTZC_CFGR2_DMA1_Msk
#define GTZC_TZIC_IER2_SYSCFGIE_Pos              GTZC_CFGR2_SYSCFG_Pos
#define GTZC_TZIC_IER2_SYSCFGIE_Msk              GTZC_CFGR2_SYSCFG_Msk
#define GTZC_TZIC_IER2_PWRIE_Pos                 GTZC_CFGR2_PWR_Pos
#define GTZC_TZIC_IER2_PWRIE_Msk                 GTZC_CFGR2_PWR_Msk
#define GTZC_TZIC_IER2_RTCIE_Pos                 GTZC_CFGR2_RTC_Pos
#define GTZC_TZIC_IER2_RTCIE_Msk                 GTZC_CFGR2_RTC_Msk
#define GTZC_TZIC_IER2_OCTOSPI1_REGIE_Pos        GTZC_CFGR2_OCTOSPI1_REG_Pos
#define GTZC_TZIC_IER2_OCTOSPI1_REGIE_Msk        GTZC_CFGR2_OCTOSPI1_REG_Msk
#define GTZC_TZIC_IER2_FMC_REGIE_Pos             GTZC_CFGR2_FMC_REG_Pos
#define GTZC_TZIC_IER2_FMC_REGIE_Msk             GTZC_CFGR2_FMC_REG_Msk
#define GTZC_TZIC_IER2_SDMMC1IE_Pos              GTZC_CFGR2_SDMMC1_Pos
#define GTZC_TZIC_IER2_SDMMC1IE_Msk              GTZC_CFGR2_SDMMC1_Msk
#define GTZC_TZIC_IER2_PKAIE_Pos                 GTZC_CFGR2_PKA_Pos
#define GTZC_TZIC_IER2_PKAIE_Msk                 GTZC_CFGR2_PKA_Msk
#define GTZC_TZIC_IER2_RNGIE_Pos                 GTZC_CFGR2_RNG_Pos
#define GTZC_TZIC_IER2_RNGIE_Msk                 GTZC_CFGR2_RNG_Msk
#define GTZC_TZIC_IER2_HASHIE_Pos                GTZC_CFGR2_HASH_Pos
#define GTZC_TZIC_IER2_HASHIE_Msk                GTZC_CFGR2_HASH_Msk
#define GTZC_TZIC_IER2_AESIE_Pos                 GTZC_CFGR2_AES_Pos
#define GTZC_TZIC_IER2_AESIE_Msk                 GTZC_CFGR2_AES_Msk
#define GTZC_TZIC_IER2_ADCIE_Pos                 GTZC_CFGR2_ADC_Pos
#define GTZC_TZIC_IER2_ADCIE_Msk                 GTZC_CFGR2_ADC_Msk
#define GTZC_TZIC_IER2_ICACHE_REGIE_Pos          GTZC_CFGR2_ICACHE_REG_Pos
#define GTZC_TZIC_IER2_ICACHE_REGIE_Msk          GTZC_CFGR2_ICACHE_REG_Msk
#define GTZC_TZIC_IER2_TSCIE_Pos                 GTZC_CFGR2_TSC_Pos
#define GTZC_TZIC_IER2_TSCIE_Msk                 GTZC_CFGR2_TSC_Msk
#define GTZC_TZIC_IER2_CRCIE_Pos                 GTZC_CFGR2_CRC_Pos
#define GTZC_TZIC_IER2_CRCIE_Msk                 GTZC_CFGR2_CRC_Msk
#define GTZC_TZIC_IER2_DFSDM1IE_Pos              GTZC_CFGR2_DFSDM1_Pos
#define GTZC_TZIC_IER2_DFSDM1IE_Msk              GTZC_CFGR2_DFSDM1_Msk
#define GTZC_TZIC_IER2_SAI2IE_Pos                GTZC_CFGR2_SAI2_Pos
#define GTZC_TZIC_IER2_SAI2IE_Msk                GTZC_CFGR2_SAI2_Msk
#define GTZC_TZIC_IER2_SAI1IE_Pos                GTZC_CFGR2_SAI1_Pos
#define GTZC_TZIC_IER2_SAI1IE_Msk                GTZC_CFGR2_SAI1_Msk
#define GTZC_TZIC_IER2_TIM17IE_Pos               GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC_IER2_TIM17IE_Msk               GTZC_CFGR2_TIM17_Msk
#define GTZC_TZIC_IER2_TIM16IE_Pos               GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC_IER2_TIM16IE_Msk               GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC_IER2_TIM15IE_Pos               GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC_IER2_TIM15IE_Msk               GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC_IER2_USART1IE_Pos              GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC_IER2_USART1IE_Msk              GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC_IER2_TIM8IE_Pos                GTZC_CFGR2_TIM8_Pos
#define GTZC_TZIC_IER2_TIM8IE_Msk                GTZC_CFGR2_TIM8_Msk

/*******************  Bits definition for GTZC_TZIC_IER3 register  ***************/
#define GTZC_TZIC_IER3_MPCBB2_REGIE_Pos         GTZC_CFGR3_MPCBB2_REG_Pos
#define GTZC_TZIC_IER3_MPCBB2_REGIE_Msk         GTZC_CFGR3_MPCBB2_REG_Msk
#define GTZC_TZIC_IER3_SRAM2IE_Pos              GTZC_CFGR3_SRAM2_Pos
#define GTZC_TZIC_IER3_SRAM2IE_Msk              GTZC_CFGR3_SRAM2_Msk
#define GTZC_TZIC_IER3_MPCBB1_REGIE_Pos         GTZC_CFGR3_MPCBB1_REG_Pos
#define GTZC_TZIC_IER3_MPCBB1_REGIE_Msk         GTZC_CFGR3_MPCBB1_REG_Msk
#define GTZC_TZIC_IER3_SRAM1IE_Pos              GTZC_CFGR3_SRAM1_Pos
#define GTZC_TZIC_IER3_SRAM1IE_Msk              GTZC_CFGR3_SRAM1_Msk
#define GTZC_TZIC_IER3_OCTOSPI1_MEMIE_Pos       GTZC_CFGR3_OCTOSPI1_MEM_Pos
#define GTZC_TZIC_IER3_OCTOSPI1_MEMIE_Msk       GTZC_CFGR3_OCTOSPI1_MEM_Msk
#define GTZC_TZIC_IER3_FMC_MEMIE_Pos            GTZC_CFGR3_FMC_MEM_Pos
#define GTZC_TZIC_IER3_FMC_MEMIE_Msk            GTZC_CFGR3_FMC_MEM_Msk
#define GTZC_TZIC_IER3_TZICIE_Pos               GTZC_CFGR3_TZIC_Pos
#define GTZC_TZIC_IER3_TZICIE_Msk               GTZC_CFGR3_TZIC_Msk
#define GTZC_TZIC_IER3_TZSCIE_Pos               GTZC_CFGR3_TZSC_Pos
#define GTZC_TZIC_IER3_TZSCIE_Msk               GTZC_CFGR3_TZSC_Msk

